[
{"title": ["Paul Hayes – Compère at the DatSci Awards"], "content": ["I’m delighted to be compering the DatSci Awards for the second year in a row. Data Science is one of the fastest growing sectors at the moment with excellent job opportunities and some stellar homegrown talent.", "The ultimate goal of data science is improving decision making, as this generally is of paramount interest to business. This years awards recognise the diversity of data scientists contributing to many different fields within the private and public sector. ", "A recent article outlined that our most valuable resource is no longer oil, but data. This was an inevitable outcome as we progress deeper into the information age. The proliferation of smartphones and the internet have made data abundant, ubiquitous and far more valuable. Data Scientists are analyzing swathes of data every day and using this information to make better decisions which in turn make our lives easier. The possibilities are extremely exciting as we look even 5 years ahead into the future. Just last week a troop of autonomous trucks took to the motorways in the UK and Tesla’s ludicrous growth is brilliant to see.", "Ireland has become a European hub for data science with many of the biggest companies in the world locating their data science centres on these shores, our data science talent is also an attraction and we need to do more to recognise them.", "It’s important to mark the significance of Ireland’s contribution to data science and these awards are a welcome addition to the Irish events calendar. After it’s tremendous success last year it’s fantastic to see the growth of the event just one year after it’s inception. The change of location from the Aviva to Croke Park was a natural progression as the awards have doubled in size – a very fitting location to celebrate Ireland’s best and brightest talent.", "And we want you to be there too to celebrate Data Science with us. Tickets for this unforgettable Data Science event are selling fast so get ", "your ticket", " for the DatSci Awards today!", " ", "\n", "\n"], "date": "August 31st, 2017"},
{"title": ["DatSci Awards are Excited to Announce the Finalists"], "content": ["The inaugural Irish DatSci Awards are excited to announce the finalists for the 6 categories ahead of this year’s awards.", "With a little over 2 weeks to go until the DatSci Awards, preparations are well underway ahead of unveiling the winners of the 6 categories.", "After extensive presentations at the Aviva Stadium last month, anticipation is high for the unveiling of the winners at the DatSci Awards ceremony on the 22nd of September in the Aviva Stadium.", "We are delighted to announce the finalists are;", "Data Scientist of the Year (Sponsored by ", "Optum", ", part of the UnitedHealth Group, Title Sponsor)", "Dave Sheehan – AIB", "Aoife D’Arcy – The Analytics Store", "Maciej Dabroswki – Altocloud", "Vincent Lonij– IBM", "Judged By –", "Edward McDonnell – Centre Director, CeADAR – Centre for Applied Data Analytics Research", "David Scanlon, ‎Venture Investment Leader, National Digital Research Centre", "Sheamus Causer – Chief Country Officer, Deutsche Bank", "Simon Cocking – Senior Editor, Irish Tech News", "Best Team of the Year for Academic Research (Sponsored by ", "Dun & Bradstreet", ")", "CeADAR – Centre for Applied Data Analytics Research", "ICHEC – The Irish Centre for High End Computing ", "Insight Galway- Insights Centre for Data Analytics, NUI Galway ", "Judged By –", "Dr Helen McBreen, Investment Director, Atlantic Bridge", "Maciej Wasiak – Founder and Chief Data Scientist, Xpanse Analytics", "Simon O’Regan – Product Owner – Zalando SE", "Paul O’Grady – Data Scientist/Engineer at  Zalando SE", "Best Multinational of the Year Award (Sponsored by ", "Accenture Digital", " )", "Pramerica", "Car Trawler", "Judged By –", "Edward McDonnell – Centre Director, CeADAR Cent", "\nre for Applied Data Analytics Research", "Mick Kerrigan – Principal Data Scientist, Independent News and Media", "Yvonne Holmes – Head of Customer Analytics & Engagement, AIB", "Anthony O’Neill – Director, Analytics Centre of Excellence , Eir", "Best Company of the Year : Indigenous Irish ", "Eir", "Core Media", "Corvil", "Judged By – ", "Cronan McNamara, Founder & CEO, Creme Global", "Tom Cockrell, Global Head of Decision Analytics, Dropbox", "John Carney, Head of Retail Analytics, Bank of Ireland", "Best Start-up of the Year (Sponsored by ", "CarTrawler", ") ", "Connectors Marketplace Ltd", "Kinesis Health Technologies ", "Orreco Ltd", "VIDiRO ", "AYLIEN", "Judged By – ", "Dermot Casey – Venture Investment Leader, National Digital Research Centre", "Jennifer Cruise – Head of Data, Core Media", "Fionnuala Healy – Startup Development Manager, Trinity College", "Bronagh Riordan – Head of Data Science, Cartrawler", "Julian Perez Alzueta – Senior Manager of Data Science, Core Media", " ", "With the ceremony drawing closer, tickets are selling fast. Ensure you have purchased your ticket before it is too late by contacting Roisin at ", "info@datsciawards.ie", " or via ", "Eventbrite", ".", "In an effort to pay it forward, and give back to the Data Science community, all proceeds from the sale of tickets to the DatSci Awards will go towards a Level 9 / MSC in Data Science / Business Analytics.", "It is sure to be an event you will not want to miss, so purchase your tickets now to avoid disappointment!", " ", "\n", "\n"], "date": "September 8th, 2016"},
{"title": ["The Countdown is on to the DatSci Awards 2016"], "content": ["With just over 2 weeks to go until the DatSci Awards, judge’s deliberations are well under way. Last Monday the judges got even closer to choosing their winners for the 6 categories  as the finalists for Best Academic Research, Indigenous Irish, Multi National, Start Up, Student and Data Scientist of the Year presented their submissions in hopes of moving closer to the winning title.", "Presentations took place in the Aviva Stadium, the chosen venue for the DatSci Awards on the 22nd of September. The day was a buzz with excitement, and graced with some of the top data science innovators in Ireland.", "It was also an incredible opportunity to share excitement about the upcoming DatSci Awards, and see all of the finalists ahead of the inaugural event.", " ", "\n", "DatSci Awards in Association with CeADAR and Next Generation", "As we are edging closer to the day, ticket sales are continuing to be a success with many already sold.", "In an effort to pay if forward to the next generation of data scientists ALL proceeds of ticket sales will be placed in a Scholarship Fund for a deserving student for a Level 9 MSc in Data Science/Business Analytics for the Academic Year 2017-2018!", "For those of you that have not already booked your ticket, please contact Roisin, at info@datsciawards.ie,  to secure your seat at the Celebratory Afternoon.", "Tickets will be €140 per person", " which will be allocated on a first-come, first-served basis, the Awards Afternoon will be taking place in the Aviva Stadium, Dublin September 22nd 2016 from 1pm -6pm.", "With your ticket you will be treated to a Drinks reception on arrival, entertainment throughout and a wonderful meal while you have the chance to network with leaders of the Data Science industry.", "Make sure to contact Roisin on the DatSci Team via email – info@DatSciAwards.ie ", "or via Eventbrite to secure your ticket today.", "We look forward to meeting you there, and enjoying a celebration of Data Science, and toasting to our finalists and ultimate winners on the night", ".", " ", "\n", "\n"], "date": "September 6th, 2016"},
{"title": ["Great response to inaugural DatSci Awards prompts application extension"], "content": ["The organisers of the first Irish DatSci awards event have been positively surprised by the number of applications for the six 2016 awards. ", "The overall goal of the awards is to raise awareness about the number of excellent data science initiatives taking place in Ireland, and to celebrate as many of the individuals and companies involved. To this end, and in response to the number of applications and inquiries for this new event, the deadline has been extended. A wide range of positive news coverage in many leading Irish tech news sites, including ", "Irish Tech News", " and others generated a lot of interest and more applications.", "6 categories to apply for", "Below are the details of the six categories open for the 2016 awards. There is a link in each section that will take you directly to the relevant application form. There is also a brief outline of the type of candidate for each category, with more details to be found on the specific page for each award. ", "The Student of the Year award is for the most inventive use of data science to solve major problems.", "http://datsciawards.ie/awards/student-of-the-year/", "Data scientists are widely regarded as the hottest job in 2016 and top Glassdoor’s ‘job score’ rankings. The winner of this category will be a unique individual who is in great demand globally across all industry sectors.", "http://datsciawards.ie/awards/data-scientist-of-the-year/", "The Data Science Startup of the Year award is for the Irish Startup with the most effective use of data and data science to build product(s) to address real customer problems.", "http://datsciawards.ie/awards/company-of-the-year-start-up/", "This award is for the business with the most effective use of data and data science to differentiate itself, and thrive in the marketplace. Make sure to give examples of innovative use of data and data science to show how this has grown the business", "http://datsciawards.ie/awards/company-of-the-year-indigenousirish/", "This is for companies that have shown the most effective use of data and data science to differentiate itself, and thrive in the marketplace. Do give examples of innovative use of data and data science to improve business processes and/or grow the business. The Data Science must be led or executed (or a large part of it) in Ireland.", "http://datsciawards.ie/awards/company-of-the-year-multinational/", "Ireland has an active and vibrant community of world leading researchers innovating with data science. The award for academic research is for the most novel breakthroughs in data science that contribute to solving major problems.", "http://datsciawards.ie/awards/best-team-academic-research/", "Apply soon, and make sure your company or individual is included!", "If you want to know anymore or have any questions please contact us here at hello@datsciawards.ie and we will be delighted assist you. We look forward to receiving your applications and seeing as many of you as possible at the first DatSci Awards in September.", " ", "\n", "\n"], "date": "July 4th, 2016"},
{"title": ["The value of data for sport and healthy activities"], "content": ["We are seeing lots of great data driven insights and innovations in the area of sporting endeavors. Euro 2016 is over, Wimbledon has been won, the Tour de France has just ended, and the ", "Olympics", " will be upon us this week. It’s been another great summer for sport, and the ability to capture more data to optimise athletic performance is making a massive impact globally.", "Data driven insights are transforming sport and sporting performance in almost every field of activity. From overseas companies such as ", "EXOS", " to locally based ones there are massive improvements in the sporting performance possible from athletes. EXOS generated data insights from the 2014 World Cup were able to evaluate that Germany ran almost eight kilometres more than their French opponents, their performance levels and even their sleep patterns. Putting all of this data together then offers the ability to draw wider insights into achieving the best possible results.", "In the recently completed Tour De France, ", "Chris Froome", " helped Team Sky to win their fourth title in five years. An impressive performance considering the team was only created in 2009. ", "Dave Brailsford", " initiated the concept of incremental gains, looking to achieve many small improvements to achieve an overall significant result based on data led insights. To this end they recruited ", "Robby Ketchell", ", to be their Chief Data Scientist at Team Sky. Talking with Robby he explained more about the value of data to achieve significant improvements in team performance. “I believe that data science is probably the most misunderstood aspect of sports science and that there is a lot of potential for improvement. That’s why I’ve decided to focus a lot of my energy on data capture, management, and optimization.” After another successful year on le tour for Team Sky it certainly seems to be yielding positive results. While other teams look to copy their success, Team Sky appear motivated to continue to leverage the value of their data based insights to continue to improve their team performances.", "In Ireland another company enjoying success in sporting fields through data led insights is ", "Kitman Labs", ", who have developed the world’s first athlete optimisation system. Their goal is to enable the evolution of performance through machine learning, computer vision, analytics and sport science. Kitman labs have demonstrated it is possible to use data to achieve real-time actionable insights to reduce player injuries and optimise athlete’s performance. Jamie Heaslip, Leinster and Ireland rugby international, is one of their most prominent investors, based on his own experience of working with Kitman Labs at Leinster Rugby Club.", "Kitman Labs have also been involved with the Irish men’s hockey team, helping them to manage their potential exposure to injuries through data based analytics. The team successfully qualified for the Rio 2016 Olympics, making them the first Irish field sport team to compete at the Olympics in over 100 years. Ireland’s men’s hockey team head coach Craig Fulton has ", "described", " the use of Kitman Labs’ injury prevention technology as “very, very helpful in preparing his side for its first appearance at the Olympics since London 1908.” This is a great example of an Irish company using data led insights to offer benefits to a wide range of sports, and potentially many more sports as well.", "These are the sort of success stories that we will be celebrating at the inaugural ", "2016 DatSci Awards", " in Dublin this September at the Aviva stadium. If you’d like to be kept in touch with the latest news and updates about the individuals and companies that will showcased this year do sign up to our occasional ", "email newsletter", " for more information. We’re always on the lookout for new and interesting data science led stories from both Irish and global companies. Let us know about them and we will share them via our twitter account ", "@DatSciAwards", ". We look forward to hearing from you, and hopefully meeting some of you at the awards event in September, if you are interested in tickets for this inaugural Awards mail hello@datsciawards.ie for information.", " ", "Image Credit: Sergey Nivens/Shutterstock", " ", "\n", "\n"], "date": "August 3rd, 2016"},
{"title": ["The positive impact of data on our health & quality of life"], "content": ["With the ", "upcoming deadline for the 2016 DatSci Awards extended to July 17th", " ", "you still have a few days left to apply. The exciting thing is that we are seeing benefits in so many areas of our lives. This article looks at some of the positive developments and innovations in the health sector.", "The more data we have, the more we are able to better learn and understand about so many aspects of our lives, especially in relation to our own health, fitness and well-being.", "The ", "Life Project", " for example by ", "Helen Pearson", " illustrates the impact of gathering over 70 years of data (and counting) from one major birth cohort in the UK. This study gathered the data from a group of people all born within one week in 1946, and has continued to track their lives ever since. Seventy years later we now live in a time where even more people and their data are possible to be monitored and studied. These early large data sets helped to uncover the link between smoking during pregnancy and infant mortality. Now with more and more wearable health technologies it is possible to learn even more.", "Here in Ireland centres like the ", "Insight Centre for Data Analytics", ", an Irish ", "#BigData", " research institute based at UCD already has over 350 researchers and is still growing. The centre’s director, ", "Brian Caulfield", ",  explains the goal of the centre ", "“is to use data as a human aid. Humans are still needed to then analyse and interpret this data, and consider the best ways to use it. The goal is to provide better data for people to make decisions, not to replace the humans”. ", "Caulfield and his team are already seeing useful applications in monitoring the health of chronically sick people in their own homes. Monitoring systems can then alert the relevant medical authorities if the person’s monitoring equipment emits any potentially dangerous warning signals. They are also working in close collaboration with Leinster Rugby and other sporting organisations to learn more about optimising human performance based on data led insights.", "The ", "Quantified Self", " is a growing movement across the world that looks to use data about ourselves to achieve ‘self knowledge through numbers’. There are local chapters all over the world, including here in Ireland. ", "Justin Lawler", " co-organiser of the Dublin Quantified Self meetup at the Trinity Science Gallery described the massive potential for health benefits from data led insights. ", "“Larry Page from Google recently said that with data mining healthcare data, over 100,000 lives could be saved annually. With advanced blood testing becoming accessible and affordable to all, this becomes achievable.” ", "Lawler’s most recent Quantified Self meetup in Dublin focussed on ", "the future of blood testing", ".", "This event showcased the exciting developments in needle-less home based blood testing. This innovations offer the ability to return a much wider range of data and insights which will help to know more about our health and well being.", "As Lawler explains, there are many potential positive applications ", "The future of detailed, easy to use blood testing opens up a range of potential new applications. Cheap and easily done high frequency blood tests for cancer, pre-diabetes or a range of additional diseases. Managing chronic diseases safely through lifestyle changes rather than drugs. Home blood testing is becoming a real possibility, companies like ", "Cor", " and ", "Cue", " are developing products to do advanced blood tests without the need for labs.” ", "Lawler also sees wider potential health benefits for us through increased access to data ", "“Cheap & accessible Quantified Self tools available to us now give us greater visibility into our health unlike ever before. Being able to track & maintain optimum health has never been more achievable.”.", "MedTech data led initiatives are speeding up the time between testing and results", "Many Irish companies are expanding the number of people they are employing in MedTech positions. Galway has developed a reputation as an important and growing area for MedTech jobs. ", "Alere", " for example, have developed innovative diagnostic medical tests that can be undertaken at the ‘point-of-care’ instead of centralised labs, enabling patients to get their test results faster and get treated quicker. This reduction in waiting time between testing and results can have massive, potentially life saving benefits. Alere also recently ", "announced ", "they will be hiring another 40 people for their Galway operations too, illustrating the wider benefits for Ireland too of being a market leader in MedTech.", "Share your positive data stories with us and apply for the DatSci Awards", "There are so many positive stories out there in the fields of data science. We’d love to hear and celebrate as many of these as possible. The DatSci awards were created for this reason, with as many categories as possible, to reward as wide a range of successful data scientist endeavours.", "If you know someone who might fit the following ", "categories ", "then do encourage them (or yourself) to apply before the ", "deadline", "; ", "# Student of the year", "# Data Scientist of the year", "# Company of the year: Startup", "# Company of the year: Indigenous Irish", "# Company of the year: Multinational", "# Best team: Academic research", "See more on our website ", "here", " ", "And follow us on twitter ", "here", " for all the latest updates, news and information on data science.", " ", " ", "\n", "\n"], "date": "July 13th, 2016"},
{"title": ["How Data Science is affecting all of our lives for the better"], "content": ["All over the world we are seeing a massive increase in the amount of data we can record and then analyse for the greater good of humanity. The data visualisations above were created using ", "D3.js", " by ", "Mike Bostock", ", a great example of how data can both be useful and beautiful too. Closer to home in Ireland we are fortunate to have many innovative companies and individuals achieving fantastic data driven insights. These achievements will be celebrated in September at the inaugural ", "DatSci Awards", ". Learn more about how to register for the event ", "here", ".", "The value of data insights for agriculture and beyond", "Herdwatch", " are a great example of an Irish data driven innovation company developed to help farmers in their daily lives monitoring their herds. The ", "Irish National Ploughing Championships", " also provides one of Ireland’s biggest annual tech ", "innovation arena", " showcasing many data driven innovations. The event had over 280,000 visitors over three days in 2015 with similar numbers expected for 2016. Demonstrating that data driven innovation in agriculture is happening rapidly in Ireland, with lots of exciting potential benefits including reduced herd mortality and healthier animals.", "Drones are also helping to achieve more data led insights for agriculture too as illustrated in this ", "interview ", "with ", "Ernest Earon, founder of Precision Agriculture,", " an aerial data company. In Ireland the drone scene is also ", "booming", " and this is enabling more and more companies to develop potential commercial insights drawing on the value of the data gathered. Ireland is in the fortunate position to be reaping the benefits of innovation in both drone technology and data analysis too. With the two together there are many more exciting future possibilities in monitoring hard to reach parts of industrial complexes, flooded areas, search and rescue operations and other scenarios where it may not be necessary to risk human life to gather important data.", "Cronan McNamara,", " founder of the annual", " ", "Predict Data conference", " (and one of the ", "judges", " for the annual DatSci awards) which showcases the potential of data to achieve valuable predictive analytics, explains why data science is so important to us in our lives. “", "Data is growing exponentially and data analytics is emerging from back office research in organisations to sit centre stage – impacting on strategy and operations and demonstrating significant value. According to Forbes: 89% of business leaders believe Big Data will revolutionise business operations in the same way the Internet did.”", "Many Irish based companies are making the most of these new opportunities, and developing new and exciting products to help bring more meaning and insights into how we live our lives. ", "Parsa Ghaffari", ", founder of Irish based company ", "Aylien", " ", "explains the opportunities that are now available ", "“ infrastructure, algorithms and data availability have reached a point where truly intelligent business applications can be built, and all the great work we’ve put into AI for the past five decades is starting to flourish and become useful.” ", "Parfan’s innovative tools are now being used globally, citing an ", "example ", "where a researcher in Japan has used the Aylien tools to further their cancer research.", "Using data insights to discover cures for cancer", "In a really exciting article in ", "Wired , March 2016", ", ", "Niven Narain", ", founder of ", "Berg", " is interviewed. Narin has developed new methodologies, aimed at reverse engineering the cancer process to tackle a range of serious life threatening cancer types. By using algorithms to discover cures to cancer his company have opened up the potential for new, rapid developments.", "Why Ireland has an exciting future ahead for data science", "Edward McDonnell Director of the ", "CeADAR Centre", " ", "for Big Data Analytics explains why Ireland is an exciting place for the data science and extracting meaningful insights from the growing volume of data.", "Ireland is building a huge competence in data analytics. The 3", "rd", " level education sector has stepped up to the challenge of significantly increasing the supply of data scientists and has produced many postgraduate conversion courses across the country in data analytics. Enterprise Ireland, the IDA and SFI have also made significant investments in large data analytics competency centres. This all taken together has positioned Ireland as a significant global player in the space. The fact that so many multi-national companies are basing their data analytics centres here is testament to the strategic foresight that pin-pointed data as the new raw material of business.", "This is only a brief introduction into all the potential exciting opportunities that data science is opening up to improve the quality of life for many people across the global. We will be sharing more of these stories with you at the ", "DatSci Awards", " in September this year. You are very welcome to attend to learn more about the exciting developments taking place in Ireland and to also meet many of the people and companies leading this revolution in data science. Watch this space as we will be announcing ticket details soon.", " ", "\n", "\n"], "date": "July 4th, 2016"},
{"title": ["June 30th deadline for DatSci Awards 2016 make sure you get your application in!"], "content": ["The inaugural DatSci Awards 2016 in association with ", "CeADAR", " and ", "Next Generation", ", will be taking place in ", "Thursday September, 22nd Aviva Stadium.", "We need your entries by June 30th! Enter ", "here ", "asap", " ", "“Data science has become one of the most desirable fields to work in across business, research and government. Skills in data science are at a premium and there are amazing career opportunities in the area. This is an opportunity to showcase your work in the area and to be celebrated amongst the best examples of data science in Ireland.”", "Cronan McNamara Founder & CEO @cremeglobal", "There are 6 categories and we’d love to see you ", "entries ", "in as many categories as you qualify for.", "Linda Davis, CEO of NextGeneration and member of the judging panel explains why data science is so important.", " ", "“Access to data at our fingertips is empowering our worlds day to day, as we learn more about our behaviour and how we are likely to behave in the future. This will impact every element of our lives from medical to how we eat to how we shop. Data is carving the commercial future of our world.”", "Data Science is really important in so many areas of our lives these days, both in work, home life and our entertainment. Even better many of the leaders and companies are based in Ireland. This is not something that is as well-known as it should be. The goal of these awards is to raise awareness about the many great Irish data success stories and to celebrate these achievements. The shortlists will be at the end of August and the winners will be announced at our awards event at the Aviva in September.", "Edward McDonnell, Director of the CeADAR Centre for Applied Data Analytics, and member of the judging panel explains the massive opportunity for businesses and individuals.", "“Business, industry and individuals collect huge amounts of data whether its financial transactions, use of websites, health records, mobile phone records, fitness logs etc, – it’s like finding diamonds in a mine!”", " ", "Our ", "judges ", " will be ensuring every application is carefully considered. An extensive panel of additional judges will be announced soon.", "Make sure you get your application in before June 30th", " to be considered for one of the six prizes and be part of this great showcase of the Irish Data Science community.", "In the words of our CEO, Linda Davis, entering and perhaps winning this award could really help you.", "“Data Science is a real emerging job family and one that is only set to grow in the coming years, becoming a key influencer in the market from an early stage will really enable your career to gain momentum and put you on the map as a person to watch in the future.”", " ", " ", "\n", "\n"], "date": "May 3rd, 2016"},
{"title": ["Using data to bring insights into our food & health"], "content": ["You are what you eat.", " We’re at an interesting time in our awareness of what is in our food and the effects it can have on us. At times it may feel like what some people are doing in terms of data and food is a little extreme. However we are what we eat, and it does make sense that what goes in will affect our behaviour, mood and performance. In five to ten years time some things that seem extreme now will probably be seen as commonplace, logical and accepted behaviour. As humans we have a tendency to forget very quickly that we used to do things differently to how we do them now. Smoking and drinking during pregnancy is a good example of how data has informed and affected behaviour, reducing levels of consumption during pregnancy. There have also been a series of ", "articles", " recently about how big data has helped athletes improve their performances at the Rio Olympics.", "Within the food sector there have also been many exciting innovations and developments driven by data based insights. Irish company ", "Nuritas", " aims to promote healthy living through scientifically proven ingredients. CEO and founder Nora Khaldi ", "explains", " “the key to reducing and preventing disease begins and ends with food and the best way to uncover what was really in food was looking at the data within to see what food is fully capable of.”", "Nuritas aims to discover ingredients from sustainable sources, including food side-streams currently not used to their full potential, to optimise global food resources. They are using artificial intelligence and DNA analysis to data-mine billions of molecules with the aim of providing access to health benefiting components within foods, called ", "bioactive peptides", ". These peptides provide unique solutions for the maintenance of health and wellness. Benefits include: anti-inflammatory activity, antimicrobial activity, muscle recovery enhancement, skin anti-aging solutions, and potential management of blood sugar levels for type 2 diabetics.", "We are also seeing a lot of growth in the area of biohacking where the aim is to look at what we put into our bodies and tweak this to achieve more optimal results. While some aspects are still contentious the increased ability to test our own blood sugar levels, heart beat rates, weight, and other key indicators do help to give us more awareness of our own key statistics. In Cork the food based startup accelerator ", "IndieBio", " is helping to support the development of many interesting food related ideas. Many award winning companies have already emerged in the 16 months since it was started. Several of which have already been spun out into potentially multi million businesses. As ", "Ron Shigeta", ", Chief Science Officer for IndieBio explains", "“Biotechnology can have the ability to change the world and put us back on balance with the earth”.", "In terms of talent watching for potential future innovations in food the annual end of programme IndieBio graduation showcases in both Cork and San Francisco have proved to be a great way to get an insight into innovations to look out for. There are other options for getting your food based idea started and Bord Bia have produced a ", "guide", " of useful resources to help you develop food related business ideas. They also launched a new food accelerator called ", "FoodWorks", " so watch this space for more innovative Irish food initiatives.", "Irish DatSci Awards coming soon on September 22nd", "We’re looking forward to seeing what ideas and companies have come up with innovative data driven insights at the inaugural Irish DatSci awards on September 22nd. You can find out more about the event ", "here", " and hopefully we will see you there as a nominee, supporter or advocate of one of the awards. Otherwise come along to support this showcase of great Irish data science talent and naturally for the fantastic networking opportunities as well. Either way the event will provide a great opportunity to showcase all the great data led initiatives taking place in Ireland. By getting as many key thought leaders and influencers into the same room also creates great potential going forward in terms of future collaborations and cross fertilisations that might take place. We look forward to seeing you there and sharing your ideas and insights.", "Image Credit: 3xy/Shutterstock", " ", "\n", "\n"], "date": "August 12th, 2016"},
{"title": ["How Data Will Improve Your Company’s Marketing Campaigns"], "content": ["DatSci heatmap generated by ", "Crazyegg", "Are you using innovative data insights for your company’s data? If you are not using data to inform your marketing decisions and campaigns then according to ", "McKinsey", " you could be at least 5 to 10% worse off than those companies that use big data insights to plan their marketing strategies.", " ", "Are you using heatmaps to understand how people interact with your websites?", "There are powerful and extremely useful tools to track and monitor how people are (and are not) using your website. These tools are widely available and offer you the ability to make decisions based on data-driven insights rather than just hunches. By learning how people are actually using your website will help to identify where users are experiencing problems or not using the site as intended. These data-driven insights will identify problem points, confusing messages, and other often unexpected insights derived from customer experiences rather than internal hunches.", "Do you review your Google analytics?", "You may not use Google for all of your company activities, but chances are your website will have access to Google Analytics or similar alternative. This is a great opportunity to dive deeper into the data behind your customers and potential customers who visit your website and online offerings. Analytics will tell you the gender, age, region, device, time of day and much more about the demographics of those people using your website. It is vitally important to know who your market is, and your website’s analytics is an incredibly powerful way to learn more about this.", " ", "There are also a number of useful ", "courses", " (which don’t require a large time commitment) that can help you to master the basics. This will help you to understand what insights you could, and should, be extracting from your website’s data analytics. It is far more useful to have some awareness of this rather that merely paying an expensive 3rd party to manage your SEO (search engine optimisation) strategies.", " ", " ", "Use the analytics available from all of your company’s social media accounts not just the company website", "As with your website’s analytics, there are valuable data insights that should be used from the company’s other social media accounts, including YouTube, Facebook, Twitter, Instagram etc. With each of these platforms there are varying levels of data available. They can clearly demonstrate where your message is effectively reaching, and where it may not be, as well as the age, location and gender of your audience.", " ", "Use tools like Google trends ", " ", "Google Trends", " is a great tool to use to see what people are searching for both historically and currently in real time. This provides you with invaluable data that you can use to ensure you are targeting your audience’s interests.", "Use data monitoring to manage the bad news too", "Sentiment analysis enables you to ensure any damage limitation is handled quicker. Good PR campaign managers are able to deal with negative news as well as positive stories. If you are monitoring social media accounts you will be aware much quicker if there are problems or negative stories emerging about your company brand or product.", "Exciting times for data driven marketing and data science in general", "At the upcoming ", "DatSci Awards", " on September 22nd there will be many exciting examples of data led business insights, using sentiment analysis to create exciting data driven techniques. Come along to the DatSci Awards and meet some of the best businesses and individuals working in Irish data science sector at the Aviva Stadium.", "Tickets are selling out fast, so book your ticket now to ensure you don’t miss out on this celebration of Data and Data Science talent in Ireland.", " ", "\n", "\n"], "date": "September 13th, 2016"},
{"title": ["The Power of Data – Dun & Bradstreet Guest Blog"], "content": ["For over 175 years, Dun & Bradstreet has been passionate about what the power of data to help grow companies. Today, we have over 250 million records in the world’s largest business database, powered by 30,000 data sources updated 5 million times per day.", "However, for modern business leaders looking to make inspired decisions, data alone is not enough.  Creating growth is dependent on how you use insights and information to deepen and recognize the opportunities hidden in your relationships with your customers, prospects, suppliers and partners. At Dun & Bradstreet, we illuminate the path to growth with unique, global analytics capabilities. By identifying the most valuable relationships within your data, we help our customers model behaviors and predict smarter outcomes that lead to better results. When businesses around the world want to understand their most important relationships, they turn to Dun & Bradstreet as a trusted source – and they have for almost two centuries.", "It is this rich heritage of growing relationships through data that has motivated Dun & Bradstreet to support the DatSci Awards in 2016. We have had a presence in Ireland since 1967, when our sales function first opened its doors. In May 2010, we expanded our Irish operation by creating a centre of excellence for Technology and Data Operations. Since then, our Dublin team has helped to accelerate our growth strategy by taking the very best of what made our company great over many years and combining it with a new approach fit for the future.", "With an established base of multinational organisations and a rich pool of highly educated, multilingual talent to draw from, Ireland provides a favourable business environment to support the development of the next generation of Dun & Bradstreet global solutions. The increasing focus in Ireland’s higher-level academic institutions on STEM, Data Science and Analytics is ensuring that we are producing a pool of talent ready to meet the challenges and opportunities of a data-driven economy. As indigenous and multinational companies turn to data and insight as a competitive advantage to drive growth, the demand for individuals who can bring technology together with unstructured data to tell a compelling story that drives real results is only going to increase.", "Ireland’s vibrant business sector is recognised internationally as a hub for innovation, research and development. The co-location of many of the world’s leading companies in technology, finance, consulting and analytics, in addition to exciting indigenous start-ups, creates an environment in which cutting edge techniques are nurtured to create the next generation of data-inspired solutions. Ireland is leading the way in helping businesses evolve to a data-driven model for making decisions, and this sector will only continue to grow as the power of data science to create value is fully realised. This new economy based on data-driven insights requires individuals and businesses to be both scientists and storytellers, and we are delighted to support the DatSci Awards in celebrating those who are at the leading edge of this emerging discipline.", "About Dun & Bradstreet", "Dun & Bradstreet (NYSE: DNB) grows the most valuable relationships in business. By uncovering truth and meaning from data, we connect our customers with the prospects, suppliers, clients and partners that matter most, and have since 1841. Nearly ninety percent of the Fortune 500, and companies of every size around the world, rely on our data, insights and analytics. For more about Dun & Bradstreet, visit ", "DNB.com", ". Twitter: ", "@DnBUS", " ", " ", "\n", "\n"], "date": "September 16th, 2016"},
{"title": ["Guest Post – Paul Hayes – DatSci Awards Compere"], "content": ["With exactly a week to go until the DatSci Awards, we are excited to announce some of the surprises on the night. Here we have a wonderful guest blog from our compere, Paul Hayes of Beachhut PR. ", "I am very excited to be a part of the Data Science Awards. I think that we are just beginning to see the huge potential for the application of Data Science across a broad range of industries. Within many businesses, data remains an untapped resource with the potential to bring huge advantages to those who are first to bring Data Science into the mix. It is truly like untapped unrefined crude oil under everyone’s office. Just like the gold rush, money will be made more in the selling of shovels than on striking a gusher. Those shovels will be mainly around Managing Metadata and Data Governance rather than Data Quality.", "The key concepts are:", "Lineage – where the data came from", "Traceability – who edited it", "Lineage and Traceability are now fiduciary duties with the fine being 5% of worldwide turnover or marrying the person with most cigarettes in the cell next to you. Data scientists and CFO’s will have to concentrate efforts as it looks like you will not only need to know what the data is but also have to be able to demonstrate where and when that data was accessed over many years.", "The emerging standards bodies will have a big role to play such as OMG (Object Management Group), EDM (Enterprise Data Management Council).", "Sitting on top of those will be the Ontologies which are above standards. ", "FIBO Financial Industry Business Ontology", ", – is an interesting one. Someone estimated that a bank is made up of 70,000 rules coupled with data. So off you go and create a bank from first principles. The main issues over the coming years will be the citizen centered use of data and how government’s will regulate the main players as data use goes exponential. Welcome to the start of the biggest spike in internet use since cat videos became a thing.", "For further reading:", "http://www.forbes.com/sites/gilpress/2015/04/30/the-supply-and-demand-of-data-scientists-what-the-surveys-say/#33996ca9205e", "https://blog.intercom.com/podcast-riley-newman-on-data-science/", "http://www.datasciencecentral.com/profiles/blogs/a-hiring-guide-for-building-a-data-driven-culture", " ", " ", "\n", "\n"], "date": "September 15th, 2016"},
{"title": ["Guest Post by Gerard Lande – Enterprise Ireland – A Growing Irish Ecosystem with Big Benefits from Big Data"], "content": ["Data Analytics is a key disruptive technology that is expected to yield enormous competitive and financial gains to those who adopt and adapt quickest, writes Gerard Lande.", "Data analytics is not an actual sector, it is a discipline that can support better decision making in every walk of life from science to social policy.", "Commercially, it has the capability to transcend all functional areas of business and is becoming pervasive in many sectors such as financial services, telecoms, pharmaceuticals, food and manufacturing.", "Data analytics differs from conventional analysis in that it uses up-to-date software to scrutinise large or complex information sets that traditional data processing methods cannot effectively analyse. It also addresses weaknesses in conventional approaches by providing advanced solutions in data capture, curation, search, storage and visualisation.", "This disruptive technology can help businesses grow, become more competitive and more profitable which in turn offers job creation prospects on top of all its other benefits for business and society at large.", "Data analytics has been identified as offering huge economic and social potential by Government with close to exponential growth in the discipline predicted in the coming years. Ireland is well placed in terms of technology and human capability to compete with the best-in-class globally, delivering the benefits identified in the Government’s Action Plan for Jobs.", "New tools and technologies are continually being developed to help companies extract value from data sets by uncovering insights not previously imagined or thought possible. These technologies can provide better and faster decision making, cost reductions and yield new products and services.", "But to avail of this opportunity, Ireland needs to keep developing its technological, skills and research ecosystem. To that end, Enterprise Ireland funded the Centre for Applied Data Analytics Research (CeADAR, ", "www.ceadar.ie", ") which has a remit to support indigenous and multi-national companies in Ireland with data analytics technology.", "Top-tier multinational and Irish ICT companies are already involved with CeADAR. Partners include:", "Realex Payments, Accenture, Sonalake, Fidelity Investments, AIB, Adaptive Mobile, Inflight, Blue Insurance, Nathean Technologies, Dolitte, CR2, Crème Global.", "The Datsci Awards is an integral part of recognising the importance and achievements of the sector in developing this ecosystem and encouraging more people to accelerate the adoption and use of Data Science within their business.", "Gerard Lande is Senior Commercialisation Specialist at the Enterprise Ireland Research & Innovation Unit ", " ", "\n", "\n"], "date": "September 19th, 2016"},
{"title": ["Only a Week To Go Until The DatSci Awards"], "content": [" ", "With exactly a week to go until the DatSci Awards, preparations are well underway to the Data Science celebration of the year, and we are edging closer to awarding our 6 deserving category winners on the night. ", " ", "With days to go, excitement is high and with that tickets are selling fast! With only a few left available, now’s your chance to snap one up before they all sell out. ", "In an effort to pay if forward to the next generation of data scientists ALL proceeds of ticket sales will be placed in a Scholarship Fund for a deserving student for a Level 9 MSc in Data Science/Business Analytics for the Academic Year 2017-2018!", "Tickets will be €140 per person ", ", the Awards Afternoon will be taking place in the Aviva Stadium, Dublin September 22nd 2016 from 1pm -6pm. ", "With your ticket you will be treated to a Drinks reception on arrival, entertainment throughout and a wonderful meal while you have the chance to network with leaders of the Data Science industry.", "Make sure to contact Roisin on the DatSci Team via email – info@DatSciAwards.ie ", "or via Eventbrite to secure your ticket today.", "We are also gaining a lot of coverage and attention in the run-up to the awards, Linda Davis, CEO of Next Generation, partners of the DatSci Awards, recently spoke on RTE Radio One about the rise of the Data Science job market, and the DatSci Awards. ", " Listen to the full interview here. ", " ", " ", "\n", "\n"], "date": "September 20th, 2016"},
{"title": ["Guest Blog – Peter Cogan, Optum and the Data Science Awards"], "content": ["I’m excited because I feel we are building something special here at Optum. We’re part of the UnitedHealth Group family of businesses and we’re bringing together Data Scientists, Analysts and Engineers in our new hub at Spencer Dock, helping Optum to cement its position as the world’s leading data-driven healthcare services company.", "I have spent the last 15 years working with advanced tooling and complex data sets in many academic and industrial areas, within a domain that is now known as Data Science. It has been incredibly exciting to observe machine learning techniques emerge from university labs, mature into widely-used open source tools, and merge with big data tooling such as Spark and H20.", "Data science in general, and machine learning in particular, have become an integral component of cutting edge solutions across a multitude of industries including telecommunications, retail, banking, insurance etc. Although it has become quick and easy to bring the latest technologies to bear on real world problems through open-source tooling, I personally feel we are only scratching the surface of what can be achieved.", "The next big challenge is to find better ways to integrate what we can accomplish with data and machine learning algorithms into business processes to ensure all elements of the business are data-driven. Demonstration of progress in this final step will no doubt be a significant contributing factor in winning the 2016 Data Scientist of the Year Award at this year’s Data Science Awards.", "I’m excited to be a part of the awards event. Optum, as a newcomer on the scene here in Dublin, felt that the Data Science Awards represented a unique opportunity to introduce ourselves.", "The Awards give everybody involved the chance to celebrate the value and passion of data scientists across the country. Be they lone-members in a startup, part of a big team in a multi-national, or embedded in a research organisation at a university, the Data Science Awards has a multitude of categories which ensures that all passionate data scientists have a chance at recognition of their talent. These opportunities gel with Optum’s values and help ensure data scientists get the recognition they deserve.", "I personally feel that data science is in the midst of a very exciting journey in Ireland. Outside of Silicon Valley, Ireland is probably the most exciting place to be doing data science right now. Irish people have an innate sense of curiosity, which is arguably the most important hidden talent a data scientist can bring to bear on any kind of problem. It is also a skill that is nearly impossible to learn. The Data Science Awards will bring national and international recognition to the varied and fascinating work being done by data scientists in Ireland.", "Optum – Title Sponsor of the DatSci Awards ", " ", "\n", "\n"], "date": "September 23rd, 2016"},
{"title": ["Guest Post – Kieran Towey, Accenture – Ireland Occupies an Unique Position in the Data Science World."], "content": ["In the first instance,  we are the location for many major global multinationals from the internet giants to the pharma sector. Data is part of their DNA. This has driven a wealth of awareness of and opportunities in statistics and data science world. The keys to the kingdom lie in the hands of those that can make agile business decisions, built upon information derived from the deluge of available data.", "Secondly, our much lauded local talent is a curious mix of drive, creativity and clear thinking, sponsored by government policy, fostered by government agencies and is supported by our third level institutions. While data science is normally viewed as highly mathematical, practitioners know that it is also part art. The ability to creatively  use data and technology to solve problems is central to its success.", "My vision of the future is a very positive one, humanity is at the start of the next great technological (R)evolution, where we will harness the power of technology to build a better, more connected world. Critically, this will free up humanity from many of the tasks we occupy ourselves with and will allow us to shape our futures in ways we can only yet glimpse.", "Accenture is proud to partner with the inaugural DatSci Awards and we are delighted to have the opportunity to recognise the creativity, passion and innovation within Ireland’s data science community.", " ", "\n", "\n"], "date": "September 21st, 2016"},
{"title": ["Oisin Boydell- Team of the Year for Academic Research Award CeADAR"], "content": ["At last year’s Awards CeADAR (", "Centre for Applied Data Analytics Research", ") won the Team of the Year for Academic Research Award, sponsored by ", "Dun & Bradstreet", ".", "CeADAR, funded by Enterprise Ireland and IDA Ireland, is a market-focused technology centre for the innovation and application of big data analytics and visualization with industry partners.", "Led by University College Dublin (UCD), in partnership with UCC and DIT, CeADAR specialises in accelerated development and deployment of technologies such as data management, predictive analytics, machine learning, real time analytics and visualisation. CeADAR is headquartered at NexusUCD, the Industry Partnership Centre at UCD.", "Members of CeADAR, winner of the Team of the Year for Academic Research Award, Shen Wang, Oisin Boydell, Jing Su and David Haughton.", "We recently checked in with Oisin Boydell to hear what he had to say about getting involved in the inaugural year and winning their Award!", "Here’s what Oisin had to say:", "“As a team it’s easy to become completely immersed in current research and projects, and not look at what else is going on. However when we heard about the upcoming inaugural DatSci Awards last year we thought it was a great opportunity to showcase the work we do and a really interesting project that we had developed. It was also great to be able to support the DatSci Awards as they rely on a good mix of entries across the award categories.", "The awards event itself was great fun, and a good occasion for the team to meet other data scientists and companies in the field and to hear about interesting projects. The party atmosphere made it feel like a real celebration of all the great work going on in data science in Ireland.", "We were delighted to win the best academic research team award and are really proud of this achievement. We’ve found that it is a great accolade to have and it helps to raise the profile of CeADAR and the work that we do.”", "Oisin Boydell is a Senior Researcher at CeADAR (Centre for Applied Data Analytics Research) at University College Dublin", "If you are interested in entering this year’s Awards, be sure to submit your entry by 6pm on 31.05.2017 a full list of this year’s categories can be found ", "here", ".", " ", "\n", "\n"], "date": "May 25th, 2017"},
{"title": ["A Day At The DatSci Awards"], "content": ["Over 200 industry leaders and Data Science specialists gathered at the Aviva Stadium yesterday for the DatSci Awards 2016. After months of planning it was incredible to finally see the event come to life. Along with celebrating the Data Science industry, and of course our twenty-one finalists were recognised for their contributions to the field of Data Science and technology. Many of those celebrated are the emerging talent within the data science community, along with progressively thinking organisations and Data Scientists within Ireland.", "Paul Hayes, technology communications consultant and founder of Beachhut PR and our MC for the evening, put on his tinfoil hat for fear his mind was being hacked, and challenged the panel is “Skynet” really coming?  It created a great and exhilarating platform to discuss the future of Data Science, with a real community feel to it.", "@paul_ogrady", " taking to the stage at ", "#DatSciAwards", " to discuss the future of AI ???? ", "pic.twitter.com/0LP1ehTb9v", "— Deirdre O’Brien (@d_indublin) ", "September 22, 2016", "Edward McDonnell, director of CeADAR: “There is no better time than now to be a data scientists!” ", "#DatSciAwards", " ", "pic.twitter.com/PNu7bOSNH6", "— Vincent Lonij (@Vincentropy) ", "September 22, 2016", "Linda Davis, CEO of Next Generation, and Edward McDonnell Centre Director at CeADAR, opened the awards and promised that the day would be no ordinary occasion.  Everything about the day was like no other, starting off with Gin o Clock at 12.30 and a DJ set by We Are Red Head,  setting the platform for all to relax into the event and get talking about how they are all going to change and how our world will look in the future.", "We have finally arrived! The crowd is rolling in and enjoying the gin cocktail bar. Lots more on the way ", "#DatSciAwards", " ", "pic.twitter.com/QHWJm4qT5X", "— Next Generation (@NextGenRecruit) ", "September 22, 2016", "Today is the day for handing out awards! ", "#DatSciAwards", " ", "pic.twitter.com/nVmMhhc2Ra", "— Mick Kerrigan (@mickkerrigan) ", "September 22, 2016", "The day was full of interactive futuristic gadgets with a little 80’s weird science throw in.  Everything about the day was designed to create a stage for meeting and learning for everybody in the room.   The street food made this feel really on trend and served street cart style allowed everyone to mingle as we waited for our turn.", "Speaking about the running of the day Linda Davis said, “", "Through the course of the day you will get to experience fantastic and exciting projects. Data Science is now impacting nearly every aspect of our lives and the cornerstone of these awards is about putting Ireland on the global map as a hub for innovation in cutting edge technology.”", "It’s said if u r the smartest person in the room, u r in the wrong room: definitely feel I’m in the right room this afo @ ", "#DatSciAwards", " ", "pic.twitter.com/VTXtwH953A", "— Hugh Quigley (@HQwitter) ", "September 22, 2016", "Co-founder of the DatSci Awards, Edward McDonnell, Director of CeADAR stated", " “The CeADAR centre is delighted to be part of this great initiative in recognising and celebrating Ireland’s talent in the field of Data Science.  So many companies are centering their global analytics centres of excellence here because of this wealth of talent and expertise and this event celebrates this bright future for the industry.”", "You couldn’t help walking away with a feeling that a new data addiction is growing inside you", "All finalists gave short video intros into their projects and the winners announced throughout the event are as follows:", "Left to Right", "CarTrawler Start Up of the Year Award Winner – Barry Greene – Chief Technical Officer – Kinesis,Deutsche Bank Student of the Year Award  Winner – Kevin Brosnan – University of Limerick, Optum Data Scientist of the Year Award Winner – Dave Sheehan – Data Scientist, AIBDun & Bradstreet Academic Research Team of the Year Winner Oisin Boydell – CeADAR & Jing Su – CeADAR, Pegasus Indigenous Irish Company of the Year Award Winner  – Fergal Toomey – Chief Scientist at Corvil, Accenture Digital Multinational Company of the Year Award Winner – Abhishek Kumar Singh –Pramerica", "Data Scientist of the Year ", "(Sponsored by Optum)", "Winner: Dave Sheehan, AIB", "Student of the Year ", "(Sponsored by Deutsche Bank)", "Winner: Kevin Brosnan, University of Limerick", "Team of the Year for Academic Research (", "Sponsored by Dun & Bradstreet)", "Winner: CeADAR", "Multinational Company of the Year Award ", "(Sponsored by Accenture Digital)", "Winner: Pramerica", "Indigenous Irish Company of the Year", " (Sponsored by Pegasus)", "Winner: Corvil", "Best Start-up of the Year ", "(Sponsored by CarTrawler)", "Winner:  Kinesis Health Technologies", " ", "Closing the ceremony was Laura Kennedy, Head of Data Science Recruitment at Next Generation.", "Laura stated ", "“Until recently the value of data has not been recognised. However, businesses big and small are now moving into a digital age by harvesting this data and incorporating it into their decision making throughout their business. The DatSci Awards, we believe, will be one of ", "the building blocks for Ireland to become the European Data Science Hub”.  ", "And to close there was a big reachout thanking the sponsors for their support including Title Sponsor Optum, Silver Sponsors  Accenture Digital, Deutsche Bank, Dun & Bradstreet, Cartrawler, Pegasus, Associate Sponsors Enterprise Ireland, Zalando and the IDA.", "All the ticket sales went to a scholarship fund to give a deserving Data Scientist the chance of a  Masters programme in Data Science/Business Analytics commencing during the academic year of 2017/2018.", " ", " ", "Until next year… bring on ", "#DatSciAwards", " 2017 ", "pic.twitter.com/xvjjytVSjT", "— DatSci Awards (@DatSciAwards) ", "September 22, 2016", " ", " ", "With an intimate and engaging atmosphere it felt like this event will only go from strength to strength next year, although we will be taking a few days off before planning DatSci Awards 2017.", "For more information on the DatSci Awards  please visit", " www.datsciawards.ie", " or follow us on twitter  @DatSciAwards", " ", "\n", "\n"], "date": "September 23rd, 2016"},
{"title": ["Fergal Toomey – What Data Science Means to Us at Corvil"], "content": ["Fergal Toomey is Chief Scientist at ", "Corvil", ", at last year’s Awards Corvil won the Indigenous Irish Company of the Year sponsored by ", "Pegasus.", "   Here’s some insight from Fergal on what Corvil do!", "Here at Corvil, generating useful insights from data has been the raison d’etre of our business for the past 17 years. We work primarily with firms who do a lot of business electronically, and who therefore depend on computers and networks to keep their own businesses running smoothly. Our role is to listen in to streaming data within these environments, and use it to generate insights that help our customers make sure their systems are optimized and secure. There’s a strong ‘real-time’ element in most of the problems we tackle, because when there’s a performance problem or a security breach in a business-critical system, our customers want to know about it immediately.", "The financial sector was a strong adopter of Corvil’s products in our early years. At the time, the world of financial trading was switching over to fully electronic operation. Computers were being used not only to execute trades, but also to make the actual decisions about when, where and what to buy and sell. Making sure that these systems behave and perform as intended is obviously a priority for their owners. And the best way to do that is by continuously collecting and analysing data that reveals what’s going on, even at the inhumanly fast speeds that trading systems typically operate at.", "In more recent years, cybersecurity has emerged as a big concern for most of our customers. Hackers have unfortunately become a lot more sophisticated, using password-phishing and zero-day exploits to break through the perimeters defences that firms relied on in the past. Once the hackers are inside, they often know exactly how to avoid triggering the static detection mechanisms that many organizations use to find them.", "To cope with these threats, the industry is turning to a more dynamic type of defence that attackers will find much harder to predict. These dynamic mechanisms are often based on machine learning. The idea is to deploy ‘cybercop’ algorithms that can learn to tell the difference between a normal user and a malicious attacker, based on their behaviour. It’s a challenging problem because the attackers are simultaneously trying to disguise their activities to the extent that they can. Nevertheless, the new techniques have shown tremendous promise, and are generating a lot of excitement in an industry that’s keen to tip the scales back against the hackers.", "When we founded Corvil in 2000, the term “Data Scientist” was pretty much unknown outside of research circles. I believed at the time that the growing availability of computing power and data would lead to new practical applications for maths, statistics and probability. The actual scale of the success that Data Science has now achieved, has nevertheless been surprising even to an original believer like me. ", "The DatSci Awards in Ireland", " last year were a wonderful illustration of this, with high calibre contributions coming from multiple sectors of Irish industry and most of our main research institutions. I’m looking forward to participating in the awards again this year, albeit this time ", "as a judge", ". Corvil will also be coming along to the awards ceremony in September to listen to the experts and enjoy the spectacle. ", "See you there!", " ", "\n", "\n"], "date": "May 29th, 2017"},
{"title": ["Shourjya Sanyal – Is Data Science Going to Replace Sports Coaches and Doctors?"], "content": ["Shourjya Sanyal, CEO of ", "Think Biosolution", " is one of 5 Finalists in this year’s  Award for ", "Best Use of Data Science in a Start Up", ".", "We wish Think Biosolution and the rest of this Finalists the best of luck in the competition!", "Want to be a part of the greatest Data Science event in Ireland and meet the winners in person? Now is your chance by getting your ", "ticket for the DatSci Awards", ".", " ", "Why should you read this?", "Traditionally medical care was primarily available to patients with acute conditions. However with the advent of modern medicine and easy availability of healthier diet and lifestyle choices, more people are choosing a healthier life. This means our society of the future needs to increase sports coaches and doctors who instead of treating sick people, will be consultants advising us on how to achieve an ever more healthier lifestyle. This also translates to the fact that instead of a small fraction asking for high levels of critical care, society is moving to a state where wellness care should be provided to all to achieve healthier lives.", "This blog talks about how data science can help the sports coaches and doctors of the future to achieve this goal. So if you are suffering from some form of a chronic condition or you are a professional athlete (or anywhere in between), the next four short paragraphs will help you understand the future of sports and healthcare.", " ", "What is Data Science?", "The term is often interchangeably used with buzzwords like ‘Big-data’ and ‘Artificial Intelligence’ in social media to refer to business analytics, or as", " a sexed-up term for statistics", ". In actual practice it is an umbrella term often used to describe the interdisciplinary field where statistical methods are used to extract and then ", "present knowledge or insights from data sets. ", "A typical data scientist often has a broad skill set of writing computer code, handling digital databases, statistics, and some working understanding of the overall area in which the data product is operating in.", "In the field of sports and medicine, data science allows coaches and doctors to statistically compare the performance of an individual athlete, or the health of an individual patient with the general population with similar conditions. This in turn can be enormously insightful in gauging how well an athlete or the patient performing and therefore fine-tune their training or medication.", " ", "How have doctors and coaches dealt with data?", "Coaches and doctors tackle two subsequent sets of tasks (from a data science point of view). First, they collate the available historical data of the athlete or the patient to determine their present fitness or health condition. Subsequently, they prescribe a routine or medication based on how a typical patient in that condition has historically been handled.", "Historically, the first task involved maintaining paper based fitness charts and histories or doctors’ prescriptions. Nowadays, technical gyms allow their subscribers to record workout durations and map how the same affects the user’s vitals like heart rate, etc. With the advent of electronic health record, where patient data is stored in a secure remote server (colloquially, the cloud), doctors can update and view patient data across clinics. However most electronic health records are accessible to certified physicians only at a relatively local scale ", "i.e.", " either a state or a country.", "The second part involves making judgements based on experience or relevant sports or clinical investigations. The coach can look into the athlete’s workout data every few days or weeks, and tweak the routine appropriately based on his prior experience. The doctors often refer to a medical journal or refer to case studies to determine the appropriate course of action. Of course, this is built upon the top of years of experience gathered both during training at medical school and while actually practicing medicine.", " ", "What are some of the cutting edge solutions available now?", "The first step of the challenge ", "i.e.", " storing medical or health data online, is widely available in EU and USA, and several developing countries are quickly catching up.", "The second step, automation, where the devices are themselves smart enough to give personalised feedback in real time to achieve the desired outcome (for both fitness and medical goals) is the current challenge. To achieve this the device needs to be wearable ", "i.e", ". the person should have the both the sensor and the computational module on his body. The device should also come up with a haptic ", "i.e.", " vibration, voice or a visual method of communicating the instructions to the athlete or the patient in a reasonably intuitive manner. Since sports tech is less regulated than medical devices, most of the cutting edge technology is currently available only to athletes. Companies like Athos, Myontec, Hexoskin and Clothing+ are leading the trend by selling smart apparel that have built in ECG sensors and well as motion trackers. These could eventually be used as a platform for building a personalised feedback mechanism. Even activity trackers like Fitbit and Jawbone are focussing beyond building just step counters to more holistic solutions for health and wellness. They are among the first companies to build a Device + App paradigm that will help people to lead a healthier lifestyle based on real time tracking of health data.", "How we hope QuasaR™ will lead this revolution?", "Our product QuasaR™ is a wearable personal fitness trainer that fits inside sports apparel. QuasaR™ helps users build cardiac and respiratory endurance and reduce obesity and stress by suggesting the optimal running intensity and duration, based on the user’s personal fitness goals. QuasaR™ measures the user’s heart rate, respiratory rate, blood oxygen saturation, and heart rate variability with medical grade accuracy and combines this data with information about the user’s speed to report fitness predictors such as vVO2max, heart rate-running speed index, etc. These predictors are then used to recommend personalised coaching routines designed by fitness coaches towards achieving endurance goals.", "For example, QuasaR™ can help athletes build cardiac endurance by first tracking how their heart rate increases with the running speed during warm-up sessions. Then during the actual training QuasaR™ uses haptic feedback to keep the user running at the lowest speed where they achieve their highest heart rate. Therefore the athlete can build their cardiac endurance without risking the chance of over exhaustion.", "For the next few years, we will focus on building a large set of running and cycling regimens with QuasaR™, beyond just endurance building exercise. This includes programmes to take the athlete from couch to 5K in a month, or even an optimal way to run the Dublin Marathon.", "However, we hope that some day this will be the stepping-stone for building a medical grade version of QuasaR™, which will perform similar recovery routines for patients suffering from cardiac and respiratory illnesses.", " ", "Is Data Science Going to Replace Sports Coaches and Doctors?", "Well, we believe that the answer is no. Activity trackers like Fitbit or Jawbone or fitness trackers like QuasaR™, Hexoskin and Athos will come up with diverse routines for giving real time feedback. However these devices will rely on the experience of professional coaches and doctors to build the new training regimens. As a result an individual may be actually be following these regimens more", "often at a low cost, while overall interaction with their coach/doctor get significantly lowered. The coach/doctor can monitor their performance remotely and prescribe solutions that directly revise the regimen. So, in effect, the coaches and doctors of the future that are armed with data science will be the architects of wellness, rather than bricklayers tackling the challenge one brick at a time.", " ", "Witness more amazing ways companies have implemented data science by ", "buying a ticket to this year’s DatSci Awards", "!", " ", "\n", "\n"], "date": "August 16th, 2017"},
{"title": ["Peter Adam – A year in Business Analytics at UCD Smurfit School of Business"], "content": ["DatSci Awards 2017 is well underway, entries have been submitted and judging panels have been allocated! I am already excited about the big party in September! We have received a huge response across our 8 categories and I was delighted to see the up take on our 2 new categories for Award for Best Use of Data Science in a Public Sector Body and Best Use of Data to Achieve Social Impact. It will be a busy few weeks for the ", "judges", " reviewing all of the submissions and then once we announce our shortlist – it will be their hands to prepare for presentations on August 17", "th", "!", "The DatSci Awards was created in an effort to Celebrate Data Science Talent, and also help the Irish and International Data Science Community connect. Another key element of the DatSci Awards is our Scholarship partnership with UCD Smurfit School!", "In an effort to pay it forward to the next generation of Data Scientists, proceeds of ticket sales will be put towards a Scholarship Fund for a Level 9 Data Science Qualification for the Academic Year of 2017 ‐2018.", "Next Generation the founders of the DatSci Awards are delighted to partner with UCD Michael Smurfit Graduate Business School to offer 2017/18 applicants (full- & part-time) for the ", "MSc Business Analytics", " the chance to win a scholarship to cover full-time EU Fees (value in 2017: EUR 13,350*). Successful applicants must meet the entry requirements.", "Scholarship Entries close on 30th June 2017.", "With only 2 weeks left until the closing date for applications – if this is something you might be considering check out a recent blog from Peter Adam who is currently a student on the course – this will give you some insight in the course and aspects of UCD Smurfit School. For further insights on the course check out a blog from Dr. James McDermott ", "here", " ", "This post was written at the request of ", "datsciawards.ie", ", presenting awards to the top Data Scientists in Ireland for 2017. I’m not nominated, but you should definitely check out the excellent people who are.", "They’ve also partnered with ", "UCD Michael Smurfit Graduate School of Business", " to give a full scholarship for the Masters of Business Analytics for 2017/18 to an EU student. If you’re thinking about a career move into Data Science, I can strongly recommend the course. More information is available ", "here", ".", "At the beginning of 2015, due to a prolonged downturn in the oil price, I was given a years leave of absence from my job as a Drilling Engineer in Norway. I was scheduled to go on vacation around the time I found out, so before I moved my life from Norway, I had two weeks to think about what to do next. The way I saw it I had three options:", "Get another job in Oil and Gas, or try and move into another field;", "Go back to college and get a new set of skills; or", "Travel, explore and party;", "There weren’t really any Oil jobs going at that time, and I didn’t feel like rushing back into work anyway (despite the downturn we were very busy in Norway, until we very much weren’t). Travel would’ve been great, but left me in a precarious position if there was not a job for me at the end of my year off.", "That left college, which then begged the question: What to study?", "I was forced to think about what it really was about my job that I enjoyed, and I realised that the most challenging and enjoyable projects I had worked on all involved data manipulation and processing. At that time, I didn’t know Data Science was a thing, but reading up on it really opened my eyes to this new world, and I realised that this was where I wanted to be.", "My introduction to Data was when I was 14, and taking part in an after school maths challenge class. I remember struggling with every question that involved calculus (which was all of them), but one time I got to use Excel, and with my dads help, built a model which correctly solved the problem! I was hooked.", "Throughout the rest of high school, and my undergraduate degree, my interest in how data moved and related within a model was my driving curiosity, though I never realised it was something I could do full time.", "I studied Chemical Process Engineering at the ", "University of Western Australia", ", and my skills with manipulating data relationships helped tremendously in building financial and processing models for my final year project and thesis. I interned at various engineering and financial institutions, and at the time thought I wanted to be a M&A analyst.", "Upon graduation, I weighed my options and opted for adventure, taking a technical offshore engineering position with ", "Schlumberger Ltd", ", based out of Stavanger, Norway.", "My role with Schlumberger was far from Data Science (I was an offshore engineer involved with drilling and logging new wells), my interest and skills in data analysis held me in good stead. When I was asked to turn some data output from a new product into a well-site visualisation for our customers, I dived into Visual Basic and got my first taste of programming. Recording macros and learning from Microsoft forums got me pretty far, and I ended up building software to automate a previously manual task and opening up a new revenue opportunity for Schlumberger.", "With skills and experience in hand, and the decision to study Data Science, the UCD Michael Smurfit Graduate School of Business stood out for it’s academic focus (as opposed to a coding bootcamp or such), and prestige in Ireland. I applied and was accepted to the MSc Business Analytics.", "The first semester was focussed on building a solid foundation of Maths, Statistics, and Project Management skills. There wasn’t as much of a focus on programming initially, but the advantage of taking the course full time was that we had ample time to develop these skills in our own time. As the semester went on, we worked in teams to build a ", "Black-Scholes option pricing model", ", and explored and critiqued ", "IT project management philosophies", ".", "We also gained a solid academic review foundation, and spent the winter thoroughly exploring an area of literature.", "The second semester saw the focus shift from theoretical to applications of algorithms. Some of the projects I’ve undertaken include:", "Deploying ", "Dijkstra’s and Bidirectional Variants", " for finding the shortest path through a network, using optimised data structures;", "Developing an algorithm to appropriately ", "assign aeroplane seating", ";", "Simulating a new ", "viral advertising model", " to increase click rates on Facebook;", "Undertaking a clustering case study to optimise ", "children’s T-shirt sizing", "; and", "Suggesting appropriate ordering of Formula 1 races to minimise travel time for drivers.", "The biggest drawcard of the course for me was the opportunity to spend the summer working on an industry partnered project. I’m working on an application to display and summarise the Irish housing sector, to aid Data Scientists at ", "AIB", " when providing insights.", "The summer practicum gives us an opportunity to apply the skills we’ve learned over the last year. Mine involves Python, Django, Javascript, D3, web-scraping, cloud computing, SKLearn and the Google Maps API.", "The course itself has been thoroughly worthwhile, and I’ve improved my academic understanding of algorithms and approaches, vastly increased my coding ability, and have a wide range of tools available to me to solve many problems.", "The course has also given me plenty of scope to improve my skills in areas around Data Science, such as learning Django to quickly deploy web apps and dashboards, D3 to visualise data, and cloud based data processing to push computational possibilities beyond my personal resources.", "I’ve also had the opportunity to take place in 3 Hackathons, each of which opened my eyes to areas which I needed to improve my skills in:", "The ESB Big Energy Hack taught me the necessity of knowing your data before focussing on a solution, as well as the difficulty of balancing multi-disciplinary teams;", "The AIB Datahack showed me that while my data cleaning skills were improving nicely, I needed more practical experience in Machine Learning; and", "The Citadel Correlation One Datathon taught me that Data Science is as much about the question being answered as it is about the process (our solution was very business focussed, whereas the winners went for more interesting insights).", "The Correlation One Datathon was a great culmination of skills, and showed how far I had come since the beginning of the course. In 6 and a half hours, we parsed 15gb of data and put together a model for Uber to optimise the distribution of drivers across New York at any point in time. As an extension of this, I explored a much larger subsection of the data to figure out which neighbourhood partied the hardest in New York.", "The social side of my time at UCD has also been a highlight, with diverse classmates, all of whom have welcomed me to Ireland. The highlight of the social calendar was the Smurfit Ball.", "I’ve also had the opportunity to represent UCD in Ultimate Frisbee, traveling to Belgium to compete in October, and placing 2nd in the Irish College Championships in April.", "It’s been a great year at UCD, and a great (if slightly roundabout) journey into Data Science. I’m really excited for all the opportunities I’m going to have to deploy the skills I’ve learned.", "I thoroughly recommend the UCD MSc Business Analytics course and really encourage budding data scientists to apply for the ", "scholarship", "!", "Good luck to all nominated for the Irish Data Science Awards in 2017!", " ", "\n", "\n"], "date": "June 16th, 2017"},
{"title": ["Max Cottica – Modern Data Challenges"], "content": ["Max Cottica, is Head of Data Science and Solutions with AIB, and has joined the DatSci 2017 Judging Panel. This year Max will be judging the SME of the Year Award and the Student of the Year Award. We caught up with him to hear is thoughts on Modern Data:", "When I was young summers were long and predictable. It would get so hot at times that me and my rascal mates visited often a fountain in the middle of the village. I was trying to collect as much water with my hands as possible to get the most out of the refreshing liquid. But my hands were so small, water would spill out all over the place. When I think of modern data, that is the image that comes to mind. Every drop of water we can’t collect equals a missing opportunity to place a sale, to support a customer, to update our reference data. You can understand how concepts like data warehouses, lakes, reservoirs, marts and ponds are getting in the way. Data needs to be collected, analysed, transformed and used for predictions in real time. Saving it on disk for one, two, three or more times cannot give us a millisecond response to our questions. Modern data is a river and we need to learn how to fish in it.", "This is the reason why technologies like Kafka, the Kappa architecture, Flink, Apex, Storm, Beam, Spark streaming, Solr, Elastic and Samza are getting more and more curious adopters. What we did to data for the good part of the last quarter of a century does not scale with the river anymore. Data needs to sit in memory, needs to be summarised to statistics, needs to be written to disk only in certain contexts or we will not be able to find the competitive edge that differentiates the successful companies from everybody else.", " ", "\n", "\n"], "date": "June 22nd, 2017"},
{"title": ["Stefano Mauceri – Identifying People Via Wrist-Worn Accelerometer Data"], "content": ["(Image ", "source", ")", "This article was written by  Stefano Mauceri who made it to ", "this year’s finals at the DatSci Awards", " as “Data Science Student Of The Year” finalist, 2017, which is proudly supported by Core Media. Stefano gave us some insight in to some recent research he conducted in researching whether a person could be identified by analysing data derived from wrist-worn accelerometers and the results look promising!", "We are excited to see Stefano and all the other contestants at the second DatSci Awards in Croke Park on the 21st of September and we would like you to be there as well to celebrate data science. Get your ticket ", "here!", "Stefano Mauceri  is entering his second year as a PhD student at the ", "UCD Natural Computing Research & Applications Group", ". His research interests include anomaly detection and bio-inspired algorithms. Prior to the ", "UCD PhD programme", ", he graduated with the ", "UCD MSc in Business Analytics", ". Previously he graduated in Economics for Tourism (MSc, Bicocca University, Milan) and Management (BSc, Bocconi University, Milan).", "Stefano applied for the “Data Science Student Of The Year” competition at DatSci Awards 2017 and was shortlisted as finalist for his  joint master’s thesis project titled: “An heuristic approach for the Green Vehicle Routing Problem”. This work will be presented by the two authors on 17th August 2017 in Croke Park (Dublin).", "Here’s what Stefano had to say:", "I’m a PhD student at the UCD Natural Computing & Applications Group and in the following lines I’ll introduce you to a research question I’m currently investigating: can we identify a person by means of wrist-worn accelerometer data?", "Wrist-worn devices popularity continues to increase not only among consumers but also in the context of medical research. Researchers see such devices as an inexpensive and unobtrusive diagnostic tool. Two central applications are the assessment of physical activity, and the study of movement disorders.", "Data integrity is of utmost importance in medical research therefore scientists want to confirm that a device is being worn only by the intended person for the entire data collection period. This is to prevent fraud or other misconduct which could invalidate their studies. In other words: given a daily time-series of accelerometer data we want to be able to tell if it has been generated by the intended person or not.", "Wrist-worn devices can record several different variables however in my study I focus only on triaxial acceleration. Other sensors commonly embedded in such devices are: a gyroscope which estimates rotation in space, and a magnetometer which determines orientation with respect to Earth’s magnetic field. Sometimes there are also a light sensor and a thermometer. These sensors along with specialised algorithms can provide information about: body posture, body temperature, energy expenditure, heart rate, light intensity, physical activity, sleep-wake cycles, and steps taken.", "Is not hard to see why wearable devices are a remarkable source of data for medical researchers. However, dealing with this data it’s not an easy task. The problem at hand and the big volume of data involved are outside the expertise of most medical researchers.", "Once again data science shows its versatility. Solving the problem of subject identification through wrist-worn accelerometer data don’t require any expertise in terms of medical knowledge but it requires familiarity with data science fundamentals. To address the problem, I have had to deal with missing values, find out the most appropriate data resolution, identify a data representation strategy, test algorithms and classification approaches and measure performance.", "My preliminary results show that with the right data representation a simple algorithm like logistic regression can achieve 85% accuracy.", "Even if it’s in an early stage my research shows promising performance.  Accelerometer data gathered through wrist-worn devices can outline a unique representation of a subject and therefore allow his/her identification. I’m now investigating advanced bio-inspired learning methods including genetic programming (GP) and neural networks.", "Celebrate data science with us and ", "the DatSci Awards finalists", " on the 21st of September in Croke Park, Dublin at the DatSci Awards. Tickets are available ", "here!", " ", "\n", "\n"], "date": "July 31st, 2017"},
{"title": ["Cian O’Mahony – What It Means Being a Chief Science Officer"], "content": ["Cian O’Mahony, Chief Science Officer at ", "Creme Global", " is  one of our 5 Finalists for 2017 for the prestigious title of Data Scientist of the Year Award powered by Deloitte Ireland. Following is an interview with Cian which gives a valuable glimpse into Cian’s project, his day to day working life and his data science journey so far!", "We wish Cian and the rest of the ", "Data Scientist of the Year Finalists", " the best of Luck in their presentations next week in Croke Park!", "Cian and his team were tasked with applying data-science techniques industry wide to develop realistic estimates of consumer risk and exposure to fragrances. Since moving to computational approaches to fragrance safety developed Cian and his team, the Research Institute for Fragrance Materials (RIFM) estimate that they have saved over $477M dollars and saved the lives of over 116,000 animals.", "Cian, what are the main tasks and responsibilities?", "I lead a team of mathematical modellers and statisticians who carry out data analysis and develop predictive models for the food and cosmetics industries.", " ", "Describe a typical day?", "When I am in the office, I meet with my team ever morning to check-in, discuss what projects they are working on and if they are having any issues and encountering technical difficulties. In the afternoons, I often have project teleconferences or webinars. I travel quite a bit across Europe, the US, and the Middle East, so when I’m travelling nothing is ever routine.", " ", "What do you find most interesting ?", "The variety. Every day is a challenge and presents different problem. My favourite thing about my job is when I or someone on my team encounter a technical challenge no one has ever faced before and we have to go into a meeting room, stand in front of a whiteboard, and brainstorm solutions.", " ", "What’s not so cool? What are the main challenges?", "Admin! In any job, particularly in management, there is an inevitable administrative workload (timesheets, HR, reporting etc.). I have little interest in that type of work, but I see it as a necessary evil to keep everything running smoothly.", " ", "How do you use mathematics within your job?", "At Creme Global, we specialise in what we call ", "predictive intake modelling", ". So, we seek to assess or predict to what extent products and foods are impacting consumers, both from a risk and benefit perspective. So, if you wanted to know how much chemicals, nutrients or bacteria are getting into people’s bodies from their diet or their use of consumer products, we can figure that out using big data sets, mathematical modelling and high performance computing.", " ", "What type of mathematics do you use to solve problems?", "Calculus (mainly ordinary and partial differential equations, integration, numerical methods) and a lot of statistics (probability, regression, Monte Carlo simulation, and data fitting).", " ", "Who or what has most influenced your career direction?", "My father initially. He was a guidance counselor and a maths teacher who told me to do what I like and keep my options open. Then, it was my lecturers Alexei Pokrovskii and Jim Grannell who taught me mathematical modelling in my first year at UCC, which made me realise I could go into any field of science as a mathematician, quickly arrive at the frontiers of knowledge and do something that adds value to the field.", " ", "Does your job allow you to have a lifestyle you are happy with?", "Of course, I wouldn’t do it otherwise. The travel can be a bit of a pain as I enjoy surfing and play a lot of music, so I do my best to try and balance those. In terms of career progression if you are an expert in a field of science ", "and ", "a mathematician, you are always in demand. Couple that with working in a young growing company, and the future looks exciting.", " ", "Tell about your secondary education?", "I went to school in Coláiste an Spioraid Naoimh in Bishopstown Cork. I did what enjoyed, so for my Leaving Cert I chose maths, physics, geography, technical drawing, English, Irish and French. I was a nerd who liked all my subjects a lot, but I think I got the biggest kick out of maths and physics.", " ", "And after secondary?", "I did a BSc in Mathematical Sciences in University College Cork and an MSc in Applied Mathematics and Pharmacy by research. I always had multiple interests, so my choices were always governed by what I enjoyed and what kept my options most open. Mathematics ticked all the boxes!", " ", "What aspects of your education have proven most important for your job?", "Having a degree in maths means you have a well trained brain, with good analytical and problem solving skills. Doing modules in programming in college meant I could put those skills to practical use. Doing a  ppostgraduate course in another science thought me how to interact with other scientists and how to do research on my own.", " ", "Did you like maths at school?", "I did higher level mathematics and physics in school purely because I liked them. When I started higher level maths for my Leaving Cert I found it extremely difficult, and I failed my first exam. Eventually I became good enough, but never top of the class. With hard work and perseverance I was able to excel, enjoyed them greatly, and so I chose Mathematical Sciences at UCC.", " ", "What  aspects  of  the  mathematics  curriculum  or  mathematics  courses  have  proven most important for your job?", "Calculus always comes in handy. Anyone who thinks differentiation is just about maximising the area of field is looking at it from a very narrow perspective (I have heard teachers say this and it worries me greatly). Statistics is my bread and butter and as someone who specialised in pure and applied mathematics, I wish I had studied more stats. Luckily though, my degree allowed me to cover a bit of everything.", " ", "What other skills do you think someone should obtain if they wanted to pursue your career?", "Learn to program, learn to program, learn to program. Learn to manipulate data, learn what programming languages exist for mathematics, learn to code, learn about technology. ", "ALL ", "mathematics outside of academia takes place on computer at some point, so you just have to come to grips with that.", " ", "What advice would you give to someone considering this job?", "For my job, you need to be an all rounder. You need to be able to understand the mathematics, the science, the domain, be able to understand and communicate with people, to be able to lead and manage a team, and be actually interested and stimulated by everything on that list. That being said though, there is always a demand for someone who specialises in any one or two of those skills, allowing them to become an expert in that area.", " ", "What kinds of work experience would provide a good background for this position?", "Get an internship in a company, university or research institute that does something you are even vaguely interested in. And look after your social life! Develop social skills and do things with people that have nothing to do with mathematics; it’s healthy and will help you develop into a more rounded person.", "Creme Global, specialise in ", "predictive intake modelling", ". They seek to assess or predict to what extent products and foods are impacting consumers, both from a risk and benefit perspective. So, if you wanted to know how much chemicals, nutrients or bacteria are getting into people’s bodies from their diet or their use of consumer products, Creme Global can figure that out using big data sets, mathematical modelling and high performance computing.", "September 21st is a day for Celebrating Ireland’s finest Data Science Talent. Be sure to ", "get your tickets", " and to get insights in to some of Ireland’s finest Data Science Projects!", "For any one who purchases their  DatSci Awards ticket before 31.08.2017, they will be in with a chance to win a free ticket to attend ", "Predict, Europe’s Leading Data Conference ", "in October! #spreadtheword", " ", "\n", "\n"], "date": "August 4th, 2017"},
{"title": ["Tom Cockrell – Recognising Ireland’s Data Science Leaders + Video"], "content": ["The DatSci Team is delighted to have Tom Cockrell, Global Head of Decision Analytics at Dropbox assist with the DatSci Awards 2017. Tom is part of the DatSci Awards 2017 Advisory Committee and Judging Panel and was also a judge in the inaugural 2016 Awards. Here is what he has to say:", "I’m excited to once again be a part of the ", "DatSci Awards", ".  It’s our opportunity to celebrate the talent we have in Ireland and the impact we are making not just here but around the globe.", "I personally think about data science from an outcomes perspective.  Namely, how does it improve how we solve practical business problems, and how we measure the impact of these practical solutions across the enterprise.   And, if proven beneficial, how do we get the toolsets into as many hands as possible.  In my experience, leading strategy and operations functions over the last 15 years I’ve seen capabilities and depth of analytical talent spread inexorably through organizations.  Today, team members at all levels and functions of fast-moving organisations are passionate to learn advanced analytics platforms to help them work more effectively and derive insights from their day-to-day.  The idea and promise of data science is longer the exclusive domain of an elite few – although of course elites still drive the science forward.  Complex analysis is becoming the language of everyday business.  It informs how we define our customers, chart the future, and market our products.  Superior companies out-compete the market by making these decisions more quickly with greater accuracy, and then consequently execute and iterate with more confidence.", "2016 Winners (left to right): Best Start-up of the Year: Kinesis Health Technologies, Student of the Year: Kevin Brosnan, University of Limerick, Data Scientist of the Year: Dave Sheehan, AIB, Team of the Year for Academic Research: The National Centre for Applied Data Analytics Research (CeADAR), Indigenous Irish Company of the Year: Corvil, Multinational Company of the Year Award: Pramerica", "These awards have in the past, and will again this year, shine a bright light on where elite professionals evolving the craft to make massive impact for their organisations.  So let’s highlight and celebrate this impact.", "As impressive as the advances have been over the last 20 years, it’s negligent to limit our focus narrowly to the business world.  So I’m glad that this year we are extending the awards categories to ", "public", " and ", "social", " impact", ".  This is inspirational work where the problems are often the most critical to address and the most nettlesome to solve.  In the last several years we’ve seen data science make material impact on our understanding of, and approach to, climate change, resource scarcity, infectious disease management, care of threatened species worldwide, and many other challenges.  Ireland has a famously long history of leading positive change in the world.  I’m glad that this year we are recognizing leaders who are extending this proud cultural tradition to the field of data science.", "Don’t forget to ", "enter this year’s DatSci awards", " for one of the ", "8 categories", " soon as the  deadline is 31.05.2017", "Check out the video below for some tips that I have for when you decide to enter this year’s DatSci Awards.", " ", "\n", "\n"], "date": "May 24th, 2017"},
{"title": ["Barry Smyth – Using AI to Run your Best Marathon"], "content": ["Barry Smyth is a researcher, teacher, entrepreneur and the DatSci Awards 2017 keynote speaker!", "On September 21st Barry will explore some examples of how our data — might help each of us to live happier, healthier, and more productive lives. He will take a look at some exciting research at the intersection between big data and machine learning.", "In the meantime, check out his recent blog which was originally featured on medium.com, it is based on a scientific paper “Running with Cases: A CBR Approach to Running Your Best Marathon” that Barry presented at the ", "25th International Conference on Case-Based Reasoning (ICCBR). ", " Where the paper was awarded for the ‘Best Paper’ published at ICCBR.", "The ICCBR conference series has been running for the last 25 years and every year attracts approximately 100 Artificial Intelligence, Machine Learning and Case-Based Reasoning researchers from around the world to present their work.", "I’ve been writing marathon-related ", "blog posts", " for about 2 years now, describing a range of studies on different aspects of marathon running, such as the influence of age, gender, and experience on performance and pacing, and focusing on race-records from a wide range of big-city marathons around the world. To date these studies have focused on analysing marathon data with a view to gaining insights into what has happened in the past; something that is often referred to as ", "descriptive analytics ", "in the world of data science. Recently I have turned my attention to the future, to use this marathon data to gain insights into what might happen in the future — ", "predictive analytics", " — and, in particular to make predictions about the potential of runners to achieve new personal best (PB) finish-times.", "In fact, what began as a bit of data-fun in my spare-time, has now started to leak into my day-job, and this week I will present a scientific paper based on this prediction work. This is not so unusual. As a Professor in the area of artificial intelligence, machine learning, and recommender systems, a major part of my job involves publishing and presenting research ideas. It usually goes something like this:", "Think of a novel idea and develop a test-system to demonstrate and evaluate it;", "Write it up as a paper and submit it to a conference or journal;", "Sometime later, receive a bunch of anonymous, usually critical, hopefully constructive, peer reviews, along with an acceptance or a rejection judgement;", "If it’s an acceptance, then prepare and submit a final (camera-ready) ‘print’ version of the paper and, if it’s a conference, travel to present the work in person.", "So, here I am in Trondheim, at the ", "25th International Conference on Case-Based Reasoning", ", where I will present a paper entitled:", "Running with Cases: A CBR Approach to Running Your Best Marathon.", "Usually my attention is focused on more conventional application domains, such as e-commerce and web search, a far cry from marathons. That my running hobby has begun merge with my research is, in itself, a nice case-study on the serendipitous nature of research and the value of — to borrow an aphorism from the world of writing — ", "researching what you know", ".", "My plan in this post is to introduce you to this research and how it came about. In the process I will try to explain the core of the work, in as non-technical a fashion as I can, as well as presenting some initial results, along with some ideas about where we will take it next.", "Not so long ago, as I droned on about my latest marathon data analysis to a friend, and fellow researcher, he asked whether it might be possible to use the data to predict a runner’s potential personal best finish-time for some upcoming marathon. To be clear, we were not talking about predicting any old marathon finish-time, based on a recent half-marathon or 10k race time; there are plenty of race calculators available to do this. Rather, we were interested in predicting a ", "challenging but achievable", " PB time, which a runner might be capable of pushing themself to achieve. As we discussed the idea further it became more and more intriguing, not to mention challenging, for a variety of reasons:", "We need to be able to predict a realistic PB finish-time for a runner, a time that will challenge them, rather than a soft target that will be readily achieved. At the same time picking a time that will be out of reach is a recipe for disaster, and liable to ruin a runner’s race if they try to achieve it.", "Predicting a target finish-time is just one part of what is needed. We also need to recommend a ", "pacing plan", " so that the runner can be advised about how to pace themselves, throughout the race, to achieve the predicted PB.", "All of this needs to be tailored for the course in question as both finish-times and pacing plans are highly influenced by the twists and turns, ups and downs, of a particular race course.", "We concluded that all of this might be achievable by using a machine learning technique called ", "case-based reasoning", " (CBR). ", "We were both very familiar with CBR, having developed a range of CBR systems and algorithms over the years, and, in what follows, I will try to give a sense of the system we built, and the initial results that we obtained using data from the last six years of the London Marathon.", "To cut to the chase, and because this is one of my longer and more technical posts, Figure 1 presents a summary of predicted personal best improvements, for men and women, based on different current marathon times. These results are for the London Marathon, but analogous results have been obtained for Chicago, Berlin, Boston, and other cities. For example, it predicts that marathoners who are currently running London in 150-minutes should be capable of improving their times by about 5 minutes in the future, to achieve a PB of 145 minutes. As current finish-times increase, so too does the potential for improvement and, in general, men enjoy greater potential for improvement than women for a given finish-time. For example, 240-minute male finishers can expect to improve by up to 22 minutes in the future, while 240-minute women can expect improvements of about 17 minutes.", "How did we generate these predictions? Let’s get back to the task at hand and describe exactly how we used case-based reasoning as the basis for this.", "Let’s begin by carefully defining the problem we wish to solve and by making some simplifying assumptions about how we might approach it. For a given runner we wish to predict a challenging but achievable finish-time, for a given marathon course, and we also want to recommend a pacing plan to help them achieve this time. For simplicity we will assume this plan will take the form of a sequence of paces (mins/km) for each of the 5km segments/splits of the marathon (5k, 10k, 15k, …, 35k, 40k) plus the final 2.2km segment (from 40k to the finish). Moreover, we will assume that all we have to go on, when it comes to generating this prediction and plan, is a ", "single marathon", " that our runner has previously run. This single marathon must include a finish-time and the split-paces. Obviously, if all we have is a single marathon, then that is not much to go on. We will come back to this later but for now it provides a starting point.", "So, imagine a runner, let’s call her Ann, who has previously run the London marathon in a time of 4 hours 13 minutes (253 minutes), with a given ", "pacing", "profile; ", "that is, a given set of split-paces", ". ", "We refer to this as Ann’s ", "non-PB time", ", in the sense that it is what we want Ann to improve upon. We wish to recommend, to Ann, a new faster, finish-time that she should be able to achieve, together with a pacing plan to achieve it.", "An aside on terminology", ": we will refer to a ", "pacing plan", " as a set of 5k split paces suggested to a runner before her race, while a ", "pacing profile", " refers to an actual set of split paces that were run in a race. So, a pacing plan is what a runner ", "should", " run. A pacing profile is what a runner ", "did", " run.", "How might we begin to solve this problem? What information have we that might help, in addition to Ann’s previous marathon record? Well, we have plenty of race records for past runners of London, and some of these are repeat runners, with multiple London marathons under their belts.", "Imagine a runner, Sarah, who has completed three London marathons, one in 252 minutes, one in 244 minutes, and one in 236 minutes. Sarah’s 253-minute finish-time is close to Ann’s, and Sarah went on to achieve a faster time (236 minutes) some time later. Does this suggest that Ann might also be capable of achieving a similar speed-up? It’s a reasonable start.", "We might find additional support among other repeat runners with similar non-PB times to Ann, and who subsequently went on to achieve faster times. For example, we might consider the 10 or 20 runners with the most similar non-PB finish-times to Ann, who all went on to run even faster finish-times. Then we have a set of 10 or 20 faster finish-times, all by people who were similar to Ann, and we could use the average of their faster finish-times as a predicted PB for Ann, arguing that these runners were once like Ann and so, all other things being equal, it is reasonable to predict that Ann might improve in a manner similar to these runners in the future.", "The basic idea, as outlined, is an example of case-based reasoning. This is a common machine learning technique, based on the intuition that, to solve some new problem (predicting a PB time for Ann) we should look to similar ", "problems", " in the past (those runners who ran similar non-PB times to Ann) and use their ", "solutions", " (subsequent PB times) as the basis of a prediction for Ann. That is CBR in a nutshell.", "Every CBR system is based on a collection of past problems (the ", "cases ", "in a ", "case base", "), each with its own ", "problem description", " and ", "solution component", ", and to solve a new problem we identify the the most similar cases, based on their problem descriptions, and adapt their solutions to fit the new problem situation.", "Case-based reasoning has some nice properties. It is intuitive and its solutions are straightforward to explain to end-users, with reference to the similar cases that have been adapted. It is computationally straightforward and relatively easy to implement in code. One of the most important advantages of CBR is that its decision-making relies on ", "examples", ", in the form of cases, rather than the carefully-crafted, hand-coded rules, which have been commonplace in more traditional forms of knowledge-based AI systems. This also means that it is easy for a CBR system to learn to solve new problems, by simply adding more cases to the case base. In the case of our marathon PB prediction task, if we have lots and lots of cases, covering male and female runners, of all ages and experience levels, and representing a wide range of finish-times, then we have a good chance of being able to find similar runners to act as a basis of a prediction for any given runner whose PB we wish to predict.", "A key idea in case-based reasoning concerns how we determine the similarity between a new situation (Ann’s recent marathon race) and a past problem in some case (Sarah’s non-PB race). We have suggested that this might simply be calculated on the basis of just their finish-times — Sarah’s 252-minute finish is very similar to Ann’s 253-minute finish, plus they are both female — but we can do better than that. For example, we can look at the pacing profile of Ann and Sarah during their non-PB races. Suppose for the sake of argument that, although Ann and Sarah have very similar finish-times, their pacing profiles are quite different. For example, suppose Ann started fast and produced a positive-split, with the first half of her race faster than the second, where as Sarah started more cautiously, and went on to finish with a negative-split, with the second half of the race faster than the first. In contrast, Paula, another 252-minute finisher, like Sarah, has a positive-split pacing profile that is more similar to Ann’s. Accordingly, despite their identical finish-times Paula is considered to be more sinilar to Ann than Sarah, because Paula paced her race more similarly to Ann than Sarah.", "In other words, when we measure similarity we use pacing information as well as finish-times and gender. The more similar another runner is to Ann, the greater the influence of their PB time on Ann’s prediction. In fact, we consider 3 ways to product a predicted PB time for a runner like Ann, from a set of similar cases:", "Best", " — we take the fastest PB time from the most similar runners.", "Mean", " — we take the average PB time from the most similar runners.", "Even", " — we take the PB time of the similar runner with the most even pacing profile, on the basis that more even pacing is usually considered to be more optimal for the marathon distance.", "In addition to predicting a PB time we also need to suggest a pacing plan to help runners achieve it, which depends greatly on the conditions of a given race course. Once again this is based on the pacing profiles of the PB races from the most similar runners to Ann, but adjusted to fit Ann’s predicted PB time. And once again, we consider 3 basic approaches:", "Best", " — we use the pacing profile of the most similar runner.", "Mean", " — we use the average pacing profile, using the profiles of all of the similar runners.", "Even", " — we use the pacing profile of the similar runner with the most evenly paced PB.", "All of this is illustrated in Figure 2. In Figure 2(a) we see Ann’s 253-minute race with a strong positive split — she started out 10% faster than her mean race-pace and finished about 7% slower — as our new input. In Figure 2(b) represent how we generate a collection of cases from the race records of people who have run at least 2 races. In this case we show Sarah’s 3 races with finish-times, 252, 244, and 236 minutes. The fastest (236 mins) is taken to be Sarah’s PB time (for the purpose of this work) and used to produce two cases for our case base: one case combines Sarah’s 252-minute non-PB time with her 236-minute PB, and the other combines her 244-minute finish with her 236-minute PB. Finally, in Figure 2(c) we see how Ann’s 253-minute race is used to retrieve a set of similar cases (Sarah’s included) to produce a predicted PB for Ann of 237 minutes, along with a new pacing plan for her. In this example, the new pacing plan is more even than Ann’s non-PB plan. It starts out a little faster than her mean race pace, but not too fast, and finishes a little slower than her mean race pace, but not too slow, and in fact the final short segment of teh race calls for Ann to push for a faster finish.", "This summarises how we make our PB predictions, by adapting the PB times and pacing profiles of similar runners for our target runner. These similar runners all have past races that are similar to our target runner’s performance, but they all went on to achieve faster times in the future, and these faster times, and their corresponding pacing profiles, are the basis of the prediction for the target runner.", "The more cases we have, the better the predictions are likely to be, and if we want to make predictions for a different marathon, let’s say Chicago, then we can generate our cases from the race records of Chicago marathoners. In fact, we might even ", "mix-and-match", " our marathons, so that cases encode the race records from different courses and provide a basis for predicting a PB for some new race on course ", "X", " based on past races from course ", "Y", ". But we are getting ahead of ourselves and all of that is for another day. For now we will stick with London.", "We built this system and loaded up its ", "case base", " based on repeat runners of the London marathon, using 215,000 race-records for 185,000 runners, during the period 2012–2017. In the end, the case base contained almost 13,000 cases based on the race histories of 5,390 male and female runners; we only considered runners who had completed at least 3 London marathons during the 2012–2017 period. Once finished and debugged it was time to test our system.", "There are two ways to test such a system. The obvious approach (one we call an ", "online", " experiment) is to deploy it and encourage runners to use it, and to report back on whether their predicted PB turned out to be accurate. The problem with this is that it can be expensive and slow: it needs to be promoted and advertised and it can take a long-time to obtain feedback from users.", "The alternative is an ", "offline", " experiment where we use the data we already have to test the system. One way to do this is called ", "cross-validation ", "and it works as follows:", "Divide the cases up into ", "training", " and ", "test ", "cases by randomly selecting 90% of the cases as ", "training cases", " and the remaining 10% as", " test cases", ", making sure that none of the runners in the test cases are also in the training cases, which might otherwise contaminate our results.", "Next, treat each test case as a new target runner who’s PB we want to predict. Use the non-PB part of the test case to generate a predicted PB-time and pacing plan, as described above.", "Compare this ", "predicted", " PB time and pacing plan to the ", "actual", " ", "PB time", " and the ", "actual", " ", "pacing plan", " of the test case. We compute a percentage difference, or ", "error,", " between the predicted and actual PB times, and we calculate a ", "similarity", " score by comparing the predicted and actual pacing plans. The bigger the error, the more different the predicted and actual PBs. The larger the similarities, the more similar the predicted and actual pacing plans. We’d like to see small prediction errors and large pacing plan similarities.", "Finally, we average these errors and similarities across all of the test cases and repeat for a different training/test splits; we do this for 10 different training/test splits (a 10-fold cross-validation).", "We perform this type of testing for each of our different strategies, ", "Best, Mean, ", "and ", "Even,", " so that we can compare them.", "In what follows we will look at the results of this testing to get a sense of (a) how accurate the PB predictions turned out to be (relative to actual PBs of the runners) and (b) how similar the suggested pacing plans were, compared to the actual pacing profiles of the PB races.", "One common question when developing a CBR system is, how many similar cases (", "k", ") should be retrieved to provide a basis for problem solving (PB prediction and pacing recommendation, in this instance). Figure 3 shows the (a) prediction accuracy and (b) pacing profile similarity for each of the three strategies (", "Best", ", ", "Mean", ", and ", "Even", "), and for different numbers of retrieved cases; for each strategy we separate the results for male and female runners (the dotted/dashed boundaries of each ‘", "ribbon plot’", ") and also show the average over all runners (the marked central lines).", "These results indicate that the ", "Mean", " strategy performs best overall, across all values of k>1. It has the lowest PB prediction error and the highest pacing profile similarity. In other words, it predicts PB times that are closest to the actual PB times of the test runners and it recommends pacing plans that are the most similar to those actually run by the runners when they achieved their PB.", "The ", "Mean ", "strategy also improves as we include more similar runners (increasing ", "k", "). For example, at ", "k=1", " the prediction error for ", "all strategies ", "is about 6% — that is, the predicted PB times are off by about 6% — and the average pacing profile similarity is about 0.85. But if we used the 10 most similar cases (", "k=10", ") then the prediction error for ", "Mean ", "falls to less than 5% and pacing plan similarity increases to about 0.88.", "The ", "Best ", "and ", "Even", " strategies perform less well. They suffer from higher prediction errors and lower pacing plan similarities for increasing ", "k", ". The ", "Best ", "strategy suffers the most because it is simply too optimistic, predicting PBs that are far too ambitious.", "It is interesting to notice, in the above results, how we can make more accurate predictions for female runners than for male runners. The prediction error for females is consistently lower than for males, and the pacing profile similarity is higher for female runners than for male runners, regardless of strategy. The literature suggests that women are more consistent pacers than men and, as such, tend to run more disciplined races, which may make them inherently more predictable, compared with men.", "Building on this idea we might also wonder whether prediction accuracy depends on the runner’s ability level. If faster runners are likely to be more disciplined, does this also make them more predictable? Evidently it does, as the results in Figure 4 testify; incidentally, we average the results for all values of ", "k", " here for simplicity.", "Faster runners enjoy PB predictions with lower error rates, and pacing profiles/plans with higher similarities, compared with slower runners; once again we can see the ", "Mean", " strategy tends to work best for all finish-times, and how women continue to enjoy better predictions and pacing plans than men. For example, the ", "Mean ", "strategy can predict a PB time with an error rate of only about 2%, for runners who are currently capable of a 150-minute London finish, and the pacing plan similarity is about 0.92. By comparison, for 240-minute finishers, the PB prediction error is considerably higher, at 6%, and pacing plan similarity falls to about 0.85.", "So far so good, especially for faster runners. One final matter to consider concerns the nature of the PBs encoded by cases. In this work, we pair non-PB times with PB times for London marathoners to produce our cases. Sometimes, the difference between a non-PB and a PB time is small, as runners gradually improve over time. Sometimes it is much larger; perhaps the runner in question has returned to London after a few years of steady progress, to register a big improvement on their previous time. Do small or large PB improvements matter with respect to prediction performance? Is it easier to make predictions for runners with more modest PB improvements than for runners who register much greater PBs?", "To test this, in Figure 5, we look at the average prediction error and pacing profile similarity, based on the percentage difference between the non-PB and PB time of cases. It turns out that it ", "is", " ", "easier", " to make predictions for runners with more modest PB improvements, after all larger PB improvements are relatively rare in our data. For example, focusing on the ", "Mean ", "strategy, when the difference between a runner’s non-PB time and their PB time is 5% (regardless of ability) then our predictions are accurate to within 3% and the pacing plans tend to have similarities of 88. But for runners with larger PB improvements, say 15%, then the prediction error grows to 10% and profile similarity falls to about 0.83.", "Interestingly, there comes a point when the ", "Best", " strategy starts to win out, at least in terms of its prediction error. When the PB difference is greater than about 12%, then the ", "Best", " strategy tends to produce PB predictions with the lowest error. But these are few and far between in practice.", "There is a lot more to say on all of this but that’s probably enough for now. We have described an approach to helping runners to achieve a new marathon PB by suggesting challenging but achievable PB times and by recommending pacing plans to help a runner achieve such a time. We have also described an offline evaluation of this approach, which suggests it is capable of making predictions that are sufficiently accurate to be useful in practice.", "Research like this is fundamentally incremental in nature. Now that we have proven the basic concept it is time to refine and iterate, and there are lots of ways to do this. At the very least we need to enrich our cases. Why rely on a single non-PB race, for example? Surely it would be better to take a runner’s race history? Yes it would. Would it also make sense to look at different machine learning techniques, other than case-based reasoning? Probably. Should we deploy it as a live system for runners to use ahead of their next marathon, and use their feedback to evaluate the approach? Certainly.", "In the coming months we will continue work on this and see where it takes us. At the very least, it should be possible to improve prediction accuracy to make the system more reliable for runners of all levels of ability. But our ambitions go beyond this and, in fact, we are looking at many different ways in which machine learning can be used to help marathon runners and other athletes, not just for PB prediction, but also for injury prevention, for recovery advice, to personalise training plans, etc.", " ", "\n", "\n"], "date": "June 30th, 2017"},
{"title": ["Dr. James McDermott – What We Talk About When We Talk About Analytics"], "content": ["By ", "Dr. James McDermott", ", Programme Director, ", "UCD Smurfit MSc in Business Analytics", "I sometimes say that business analytics is about making decisions – better. With that I’m trying to convey a vision of business analytics which is broader than just data and computation. It’s about helping organisations to achieve several goals: to understand what has happened, to predict what will happen, and to make the best possible decision now.", "So while data and computation are at the core, so are the softer-edged concepts of decision analytics and the less data-oriented, more algorithm methods of optimisation. And business analytics is fundamentally about translation – translating a business problem into the language of algorithms and analysis, and translating a solution back into the language of clients and management.", "In this short article I will expand on this description of analytics, and then approach it from another angle by analysing the types of projects undertaken by the students of the UCD Smurfit MSc in Business Analytics.", "It’s common to describe a kind of “ladder” of analytics, progressing from descriptive through predictive to prescriptive analytics.", "A well-known example of the ladder model is Gartner’s “Analytic Value Escalator” which is reproduced below. It adds a category, diagnostic analytics, which in other models is merged with descriptive analytics. It suggests a progression up the ladder in terms both of sophistication and of potential value to the business.", "(Image source: ", "flickr", ")", " ", "To a first approximation, descriptive analytics means statistics, visualisation, and unsupervised learning; predictive means supervised learning including linear regression, logistic regression, support vector machines, decision trees and forests; and prescriptive analytics means optimisation and decision analytics.", "Where do the current buzzwords of big data and deep learning fit into this? Both are at a perhaps surprisingly “low” rung of the ladder. Very few businesses actually deal with big data, and of those that do, the majority only need descriptive analytics on it. Deep learning is a class of methods that usually sit on the predictive rung of the ladder, along with plain old linear regression – a bit more sophisticated, and more powerful, but essentially answering the same types of questions.", "For most of these methods, some mathematical understanding is required to avoid making dangerous mistakes, though visualisation and machine learning methods are becoming increasingly commoditized. But for all types of analytics, a much broader array of skills are really needed:", "business insight and domain knowledge;", "communication with clients, management, and domain specialists;", "presentation, visualisation, and written reports;", "understanding of real-world decision-making processes;", "computing chops to munge data and glue algorithms together – even if you never write a line of optimisation or statistical code.", "This spectrum from basic to advanced analytics has been proposed to explain the analytics journey that organisations go through, and sometimes that is what happens in practice. However I think a more typical journey, for many organisation and individuals, may start with simple methods being applied at any rung of the ladder, followed by increased sophistication. For example, it is often possible to establish a simple automated classification system based only on domain knowledge and good data quality – no learning models required. This can be used as a baseline and a sanity check against which to measure more sophisticated machine learning methods as the organisation gains the required expertise.", "The above could be called an intensional definition of business analytics. But an extensional definition might be useful too: what do we talk about, when we talk about business analytics? In particular, what do analytics organisations talk about, when they come into our classrooms in UCD Smurfit?", "\nTo address this question, I have taken a data set consisting of the projects proposed by analytics organisations for collaboration with the students of the ", "UCD MSc in Business Analytics", " over the past 6 years. I’ve labelled it by industrial sector, by business function, and by analytics method(s) used.", "I’ve found that almost all sectors of industry are represented, from obvious candidates like finance through to less obvious ones including sports, agriculture and forestry, and the public sector, as shown below:", "Moreover, these analytics projects are being used in pretty much all business functions – from core functions and operations through to sales, CRM, and HR.", "Concerning the methods being used, as shown below, the obvious result is that – perhaps predictably – predictive analytics in the form of supervised learning is very popular.", " ", "But beyond these a very broad range of methods have been required. Unsupervised learning is popular too. Natural language processing (NLP) and time-series methods are often required either as stand-alone methods or as inputs to other algorithms. Optimisation, including both “classical” and metaheuristic optimisation remain popular, reflecting a broad interpretation of analytics and also reflecting its roots in the field of operations research.", "Multi-criteria decision-making (MCDM) is the term I’m using for the field of decision analytics which is not primarily about data and computation, but rather about understanding and improving the decision-making process – based on evidence. Again, this reflects a broader set of concerns than just “data for its own sake”.", "Our partners also often suggest more niche methods including spatial analytics, recommender systems, network models, and simulation methods.", "We can draw a few conclusions and speculate about the future. Over time, we have noticed an increased interest in extracting value from text, spatial, network and other forms of non-tabular data. This reflects business intuition that value can be extracted from such data, and a recognition that basic tools and approaches – say, linear regression in Excel – are a bad fit.", "\nThe dominance of supervised learning suggests that there are opportunities for deep learning and other advanced algorithms which can go beyond the performance of standard regression and classification techniques.", "However, “unsupervised learning is believed to be a key for future progress on deep learning towards AI” (", "Bengio", "). We believe that unsupervised learning will tend to grow in importance, in comparison with supervised learning. This reflects the increased power of algorithms for unsupervised learning – probably the biggest achievement of deep learning so far – but in particular it reflects the wide availability of large datasets which are suitable for unsupervised learning but not for supervised. Businesses have this data and want to understand and extract value from it.", "Although less hyped at the moment, there is continued interest in “", "the science of better", "“, that is operations research and optimisation. These are often targeted more at shaving 1% off (say) transport costs, rather than at achieving understanding or prediction. But that 1% can be very meaningful.", "Finally, we are seeing an ever-broadening array of applications, and we expect to see our students using analytics in more and more unexpected applications every year.", " ", "Next Generation the founders of the DatSci Awards are delighted to partner with ", "UCD Michael Smurfit Graduate Business School", " to offer 2017/18 applicants (full- & part-time) for the MSc Business Analytics the chance to win a scholarship to cover full-time EU Fees (value in 2017: EUR 13,350*). Successful applicants must meet the entry requirements. Early bird tickets are available until the 31st of May 2017. ", "Learn more", " ", "\n", "\n"], "date": "May 8th, 2017"},
{"title": ["Hunter Kelly (Zalando) – Closing the Data-Quality Loop"], "content": ["Zalando is nominated for the award for ", "best use of Data Science in a SME", ", sponsored by ", "Enterprise Ireland", ". The competition is fierce and all the nominees gave excellent presentations. Now it’s up to ", "the judges", " to decide who will claim the coveted Data Science award and you can be there too! ", "Get your ticket", " for this year’s DatSci Awards and celebrate data science with us and the winners!", "On August 17th in Croke Park, Hunter Kelly, Senior Software/ Data Engineer and Martina Naughton, Data Scientist from Zalando Ireland presented their submission to our established panel of judges.", "Hunter has given us some insight into Zalando and how they close the Data Quality Loop, his blog was originally featured on the Zalando Technology Blog.", "Here’s what Hunter had to say:", "As the Zalando Dublin Fashion Content Platform (FCP) continues to grow, we now have many different types of machine learning models.  As such, we need high quality labelled data sets that we can use to benchmark model performance and evaluate changes to the model.  Not only do we need such data sets for final validation, but going forward, we also need methods to acquire high-quality labelled data sets for training models.  This is becoming particular clear as we start working on models for languages other than English.", "Creating a “Golden Standard” corpus generally requires a human being to look at something and make some decisions.  This can be quite time consuming, and ultimately quite costly, as it is often the researcher(s) conducting the experiment that end up doing the labelling.  However, the labelling tasks themselves don’t always require much prior knowledge, and could be done by anyone reasonably computer literate.  In this era of crowdsourcing platforms such as ", "Amazon’s Mechanical Turk", "and ", "CrowdFlower", ", it makes sense to leverage these platforms to try to create these high quality data sets at a reasonable cost.", "Back when we first created our English language Fashion Classifier, we bootstrapped our labelled data by using the (now defunct) ", "DMOZ", ", also known as the Open Directory Project.  This was a site where volunteers, since 1998, were hand categorizing websites and webpages.  A web page could live under one or more “Categories”.  Using a snapshot of the site, we took any web pages/sites that had a category that contained the word “fashion” anywhere in it’s name.  This became our “fashion” dataset.  We then also took a number of webpages and sites from categories like “News”, “Sports”, etc, to create our “non-fashion” dataset.", "Taking these two sets of links, and with the assumption that they would be noisy, but “good enough”, we generated our data sets and went about building our classifier.  And from all appearances, the data was “good enough”.   We were able to build a classifier that performed well on the validation and test sets, as well as on some small, hand-crafted sanity test sets.  But now, as we circle around, creating classifiers in multiple languages and for different purposes, we want to know:", "What is our data processing quality, assessed against real data?", "When we train a new model, is this new model better?  In what ways is it better?", "How accurate were our assumptions regarding “noisy but good enough”?", "Do we need to revisit our data acquisition strategy, to reduce the noise?", "And of course, the perennial question for any machine learning practitioner:", "How can I get more data??!?", "Given that Zalando already had a trial account with CrowdFlower, it was the natural choice of crowdsourcing platform to go with.  With some help from our colleagues, we were able to get set up and understand the basics of how to use the platform.", "Rather than bog down the main explanation of the approach with too many side notes, it is worth mentioning up-front that crowdsourcing should be viewed as an ", "adversarial system", ".", "CrowdFlower “jobs” work on the idea of “questions”, and the reviewer is presented with a number of questions per page.  On each page there will be one “test question”, which you must supply.  As such, the test questions are viewed as ground truth and are used to ensure that the reviewers are maintaining a high enough accuracy (configurable) on their answers.", "Always remember, though, that a reviewer wants to answer as many questions as quickly as possible to maximize their earnings.  They will likely only skim the instructions, if they look at them at all.  It is important to consider accuracy thresholds and to design your jobs such that they cannot be easily gamed.  One step that we took, for example, was to put all the links through a URL shortener (", "see here", "), so that the reviewer could not simply look at the url and make a guess; they actually had to open up the page to make a decision.", "We created a very simple job that contained 10 panels with a link and a dropdown, as shown below.", "We had a data set of hand-picked links to use as our ground-truth test questions, approximately 90 fashion links, and 45 non-fashion links.  We then also picked some of the links we had from our DMOZ data set, and used those to run some experiments on.  Since this was solely about learning how to use the platform, we didn’t agonize over this data set, we just picked 100 nominally fashion links, and 100 nominally non-fashion links, and uploaded those as the data to use for the questions.", "We ran two initial experiments: the first one we had tried to use some of the more exotic, interesting “Quality Control” settings that CrowdFlower makes available, but we found that the number of “Untrusted Judgements” was far too high compared to “Trusted Judgements”.  We simply stopped the job, copied it and launched another.", "The second of the initial experiments proved quite promising: we got 200 links classified, with 3 judgements per link (so 600 trusted judgements in total).  The classifications from the reviewers matched the DMOZ labels pretty closely.  All the links where the DMOZ label and the CrowdFlower reviewers disagreed were examined; there was one borderline case that was understandable, and the rest were actually indicative of the noise we expected to see in the DMOZ labels.", "Interestingly, we really overpaid on the first job.  Dial down the costs until after you’ve run a few experiments.  If the “Contributor Satisfaction” panel on the main monitoring page has a “good” (green) rating, you’re probably paying too much.", "Start simple.  While it is tempting to play with the advanced features right from the get-go, don’t.  They can cause problems with your job running smoothly; only add them in if/when they are needed.", "You can upload your ground truth questions directly rather than using the UI, see these ", "CrowdFlower docs", " for more information.", "You can have extra fields in the data you upload that isn’t viewed by the user at all; we were then able to use the CrowdFlower UI to quickly create pivot tables and compare the DMOZ labels against the generated labels.", "You can get pretty reasonable results even with minimal instructions.", "Design your job such that “bad apples” can’t game the system.", "It’s fast!  You can get quite a few results in just an hour or two.", "It’s cheap!  You can run some initial experiments and get a feeling for what the quality is like for very little.  Even with our “massive” overspend on the first job, we still spent less than $10 total on our experiments.", "Given the promising results from the initial experiments, we decided to proceed and collect a “Golden Standard” corpus of links, with approximately 5000 examples from each class (fashion and non-fashion).  Here is a brief overview of the data collection process:", "Combine our original DMOZ link seed set with our current seed set", "Use this new seed set to search the most recent ", "CommonCrawl", " index to generate candidate links", "Filter out any links that had been used in the training or evaluation of our existing classifiers", "Sample approximately 10k links from each class: we intentionally sampled more than the target number to account for inevitable loss", "Run the sampled links through a URL shortener to anonymize the urls", "Prepared the data for upload to CrowdFlower", "With data in hand, we wanted to make some final tweaks to the job before running it.  We fleshed out the instructions (not shown) with examples and more thorough definitions, even though we realized they would not be read by many.  We upped the minimum accuracy from 70% to 85% (as suggested by CrowdFlower).  Finally, we adjusted the text in the actual panels to explain what to do in borderline or error cases.", "We ran a final experiment against the same 200 links as in the previous experiments.  The results were very similar, if not marginally better than the previous experiment, so we felt confident that the changes hadn’t made anything worse.  We then incorporated the classified links as new ground truth test questions (where appropriate) into the final job.", "We launched the job, asking for 15k links from a pool of roughly 20k.  Why 15k?  We wanted 5k links from each class; we were estimating about 20% noise on the DMOZ labels.  We also wanted a high level of agreement, so links that had 3/3 reviewers agreeing.  From the previous experiments, we were getting unanimous agreement on about 80% of the links seen.  So 10k + noise + agreement + fudge factor + human predilection for nice round numbers = 15k.", "We launched the job in the afternoon; it completed overnight and the results were ready for analysis the next morning, which leads to…", "How does the DMOZ data compare to the CrowdFlower data?  How good was “good enough”?", "We can see two things, right away:", "1. The things in DMOZ that we assumed were mostly not fashion, were, in fact, mostly not fashion.  1.5% noise is pretty acceptable.", "2. Roughly 22% of all our DMOZ “Fashion” links are not fashion.  This is pretty noisy, and indicates that it was worth all the effort of building this properly labelled “Golden Standard” corpora in the first place!  There is definitely room for improvement in our data acquisition strategy.", "Now, those percentages change if we only take into account the links where all the reviewers were in agreement; the noise in the fashion set drops down to 15%.  That’s still pretty noisy.", "So what did we end up with, for use in the final classifier evaluations?  Note that the total numbers don’t add up to 15k because we simply skipped links that produced errors on fetching, 404s, etc.", "This shows us, that similar to the initial experiments, that we had unanimous agreement roughly 80% of the time.", "Aside: It’s interesting to note that both the DMOZ noise and the number of links where opinions were split work out to about 20%.  Does this point to some deeper truth about human contentiousness?  Who knows!", "So what should we use to do our final evaluation?  It’s tempting to use the clean set of data, where everyone is in agreement.  But on the other hand, we don’t want to unintentionally add bias to our classifiers by only evaluating it on clean data.  So ", "why not both?", "  Below are the results of running our old baseline classifier, as well as our new slimmer classifier, against both the “Unanimous” and “All” data sets.", "Taking a look at our seeds and comparing that to the returned links, we find that 4,023 of the 15,000 are links in the seed set, with the following breakdown when we compare against nominal DMOZ labels:", "Overall, the assumption that the DMOZ was “good enough” for our initial data acquisition was pretty valid.  It allowed us to move our project forward without a lot of time agonizing over labelled data.", "The DMOZ data ", "was", " quite noisy, however, and could lead to misunderstandings about the actual quality of our models if used as a “Golden Standard”.", "Crowdsourcing, and CrowdFlower, in particular, can be a viable way to accrue labelled data quickly and for a reasonable price.", "We now have a “Golden Standard” corpus for our English Fashion Classifier against which we can measure changes.", "We now have a methodology for creating not only “Golden Standard” corpora for measuring our current data processing quality, but a method that can be extended to create larger data sets that can be used for training and validation.", "There may be room to improve the quality of our classifier by using a different type of classifier, that is more robust in the face of noise in the training data (since we’ve established that our original training data was quite noisy).", "There may be room to improve the quality of the classifier by creating a less noisy training and validation set.", "Machine Learning can be a great toolkit to use to solve tricky problems, but the quality of data is paramount, not just for training but also for evaluation.  Not only here in Dublin, but all across Zalando, we’re beginning to reap the benefits of affordable, high quality datasets that can be used for training and evaluation.  We’ve just scratched the surface, and we’re looking forward to seeing what’s next in the pipeline", "We are excited to see Zalando as a finalist for this year’s DatSci Awards. Zalando’s unique way of implementing Data Science within the organisation is truly mind blowing.", "Join us at the DatSci awards and see Zalando and other companies. Get your ticket ", "here", ".", " ", "This article originally appeared on http://techblog.zalando.com/closing-the-data-quality-loop/ and is republished here with approval of Hunter Kelly.", " ", "\n", "\n"], "date": "August 21st, 2017"},
{"title": ["Martin Perry (Microsoft) – Big Data Insights"], "content": ["This year we had a ", "HUGE", " number of entries from many different industries for the Best Use of Data Science in a Large Company Award powered by ", "FTI Consulting", ". This Year’s ", "Large Company finalists ", "consist of Bank of Ireland, Vodafone, Depuy Synthes, Microsoft and Core Media, who’s teams were represented them in force at the presentation finals on August 17th in Croke Park.", "Martin Perry, Senior Data Professional at Microsoft, led his team on presentation day and has written this great piece on Big Data Insight to provide a better understanding as to what drives companies to use Big Data and where this data derives from.", "The business opportunity of Big Data is extracting value.  Data produced by business is expanding exponentially and is now a significant trend for IT and Business in 2017.  Notably:", "90% of the world’s data was created in last two years.", "every two days now we create as much information as we did from the dawn of civilization ", "up until 2003", "currently the volume of data created by U.S. companies alone each year is enough to fill ", "ten thousand Libraries of Congress", ".", "Data production will be ", "44 times greater in 2020", " than it was in 2009.", "Businesses have access to mountains of data., such as range of data from transaction logs captured within databases, to customer data within their CRM Systems, to publicly available data from the Web and social networking sites.", "There is the challenge in extracting value from such data, with more than 37.5% of large organizations saying that", " analyzing big data is the biggest challenge", ".  Yet analysing these large data sets is a source of competitive advantage.  Through data driven knowledge discovery of actionable information, data can provide insight such as:", "Sales growth from analyzing customers’ preferences to products and services\n", "\n", "Akamai analyses 75 million events per day to better target advertisements", "\n", "\n", "Productivity growth from collecting and analyzing transactional data leading to business process improvement.\n", "\n", "A retailer using big data has the potential to increase its operating margin by more than ", "60 percent", ".", "\n", "\n", " ", "Multiple sources are responsible for the explosive growth of accessible data.  Some of these sources are entirely new data sources, while others are a change in the access and availability of existing data generation.  There is huge growth with the creation of digital representations of existing data in Industries such as:", "Transportation", " – Sensor data are being generated at an accelerating rate from fleet GPS transceivers", "Logistics, retail, & utilities", ", – the use of RFID (radio-frequency identification) tag readers and smart meters", "Telecommunications", " – cell phones generate substantial data records including geolocation elements", "Health care", " – an industry that is moving quickly to electronic medical records and images, for uses such as short-term public health monitoring and long-term research programs", "Government", " – examples are digitizing public records such as censuses, energy usage, budgets, Freedom of Information Act documents, and law enforcement reporting.", "Entertainment media", " – there has been a huge impact of digital recording, production, and delivery of content. In addition, the collection of user behavior data to better personalize offerings.", "Life sciences", " – Low-cost gene sequencing generates tens of terabytes of information that can be analyzed for genetic variations and increasing potential treatment effectiveness.", " ", "Commercially available spreadsheet software (such as Excel and OpenOffice Calc) have a maximum number of rows per sheet of just over 1 million (1,048,576).  Google Sheets, the online spreadsheet application, can only handle 2 million cells – the maximum number rows being dictated by numbers columns used (e.g. a four column sheet can only be able to handle 250,000 rows).", "However volume is not the only component of big data.  The 5 V’s model is effective for defining Big Data- Figure 1‑1:", "Figure 1‑1 Five V Model for Defining Big Data", "Volume: ", "Big Data comes in one size: big. Terabytes and petabytes of information are easily amassed", "Velocity: ", "Data is often time sensitive", ", both how fast data is being produced and how fast the data must be processed to meet demand.  There is increasing demand for the technology to analyse the data as it is being produced.", "Variety:", " Big Data extends beyond structured data to include unstructured data. Previously structured data that neatly fitted into tables or relational databases, such as financial data, was the focus for enterprises. Now with ", "80% of the world’s data being unstructured", " (text, images, video, voice, messages, social media conversations, photos, sensor data, video or voice recordings) this has become ", "more important", ".", "Veracity", ": Purity of information is critical for Quality and accuracy remain essential requirements.", "Value: ", "Value is essential to help with:\n", "\n", "understanding and targeting customers", "\n", "understanding and optimizing business processes", "\n", "improving healthcare and public health", "\n", "improving science and research", "\n", "\n", " ", "Data, big, or small, has no value itself, unless it can provide insight that leads to ", "action", " and thus desired outcomes. This is key to unlocking the value of the data requires the right questions must be asked of the data. See figure 1‑2.", "Figure 1‑2 Insight Leads to Desired Outcomes", "According to Gartner, an ‘organization that successfully integrate high-value, diverse new information types and sources into a coherent information management infrastructure will outperform their industry peers financially by more than ", "20 percent", "‘.", "Are you making the most of your data sources?", "Be sure to ", "get your ticket", " for this year’s DatSci Awards taking place on 21st September 2017 in Croke Park, Dublin, Ireland.", "It will be a unique Awards that will give you the opportunity to connect with over 400 Leading Data Science Professionals and to learn from your peers in the Data Science Community!", " ", "\n", "\n"], "date": "August 23rd, 2017"}
]